export const FILTERS = {
    all: {
        text: "Все",
        default: true,
    },
    favorite: {
        text: "Избранные",
    },
    relatives: {
        text: "Родные",
    },
    apprentices: {
        text: "Ученики",
    },
    scientists: {
        text: "Ученые",
    },
    customers: {
        text: "Заказчики",
    },
    officials: {
        text: "Чиновники",
    },
    foreigners: {
        text: "Иностранцы",
    },
    other: {
        text: "Прочие",
    }
};

export const CONTACTS =
    [
  {
    "name": "Александр I",
    "image": "portrait-1.jpg",
    "text": "Александр I (1777–1825) — российский император, правивший с 1801 по 1825 год. В годы правления Екатерины II Иван Петрович Кулибин изготавливал игрушки для ее внука, будущего императора Александра I. \nВо время царствования Александра Кулибин не раз обращался к нему с проектами своих изобретений. Императора и изобретателя связывала продолжительная переписка, посвящённая обсуждению мостовых сооружений.\nНа закате жизни, испытывая тоску по родным местам, Кулибин подал прошение об отставке из Академии наук. Александр I, желая лично проститься с выдающимся мастером, назначил ему аудиенцию, во время которой выразил благодарность за многолетние труды и распорядился погасить все долги изобретателя, составлявшие значительную по тем временам сумму в 6 тысяч рублей.",
    "tags": [
      "favorite"
    ]
  },
  {
    "name": "Андрей кузнец",
    "image": "",
    "text": "Андрей (даты жизни неизвестны) — кузнец, с которым Иван Кулибин советовался по обработке металлических элементов для мостов.",
    "tags": [
      "other"
    ]
  },
  {
    "name": "Аракчеев Алексей Андреевич",
    "image": "",
    "text": "Аракчеев Алексей Андреевич (1769–1834) — военный министр при Александре I, игравший значительную роль в управлении государством после Отечественной войны 1812 года. Он инициировал создание военных поселений, сочетавших военную службу с сельскохозяйственным трудом для снижения затрат на армию. Однако реформа вызвала широкое недовольство и была впоследствии упразднена. Его имя связывают с термином «Аракчеевщина» — символом жесткой дисциплины и полицейского деспотизма. Иван Петрович Кулибин, не получив ответа на прошение о рассмотрении проекта металлического моста от Александра I, обратился к Аракчееву с просьбой передать его императору.",
    "tags": []
  },
  {
    "name": "Аршеневские (предполагаемые заказчики часов)",
    "image": "",
    "text": null,
    "tags": [
      "customers"
    ]
  },
  {
    "name": "Барышников (предполагаемый заказчик часов)",
    "image": "",
    "text": null,
    "tags": [
      "customers"
    ]
  },
  {
    "name": "Баташов (предполагаемый заказчик часов)",
    "image": "",
    "text": null,
    "tags": [
      "customers"
    ]
  },
  {
    "name": "Безбородко (предполагаемый заказчик часов)",
    "image": "",
    "text": null,
    "tags": [
      "customers"
    ]
  },
  {
    "name": "Браницкая Александра Васильевна",
    "image": "",
    "text": "Браницкая Александра Васильевна (1754–1838) — заказчица металлического кронштейна для установки фонарей.",
    "tags": [
      "customers"
    ]
  },
  {
    "name": "Бриль Адам Иванович",
    "image": "",
    "text": "Бриль Адам Иванович (1719–1786) — генерал–поручик и иркутский губернатор, сыграл важную роль в развитии региона. Приехав в Иркутск из Петербурга в 1767 году, он активно занимался улучшением инфраструктуры и поддержкой научных исследований. Предоставил Кулибину метеорологические данные, включая информацию о барометрах, необходимые для разработки новых приборов и улучшения точности метеорологических наблюдений.",
    "tags": [
      "officials"
    ]
  },
  {
    "name": "Брюс Яков Александрович (предполагаемый заказчик часов)",
    "image": "",
    "text": null,
    "tags": [
      "customers"
    ]
  },
  {
    "name": "Буссе Иван Фомич",
    "image": "",
    "text": "Буссе Иван Фомич (1763–1835) — унтер–библиотекарь, отвечавший за сохранность и работу часов в форме яйца после отъезда Ивана Петровича Кулибина из Петербурга в Нижний Новгород.",
    "tags": [
      "other"
    ]
  },
  {
    "name": "Буш Иван Фёдорович",
    "image": "portrait-2.jpg",
    "text": "Буш Иван Федорович (1771–1843) –– академик, заведующий кафедрой хирургии Медико–хирургической академии, высоко оценивший протез ноги, разработанный Иваном Петровичем Кулибиным.",
    "tags": [
      "scientists"
    ]
  },
  {
    "name": "Владимиров (предполагаемый заказчик часов)",
    "image": "",
    "text": null,
    "tags": [
      "customers"
    ]
  },
  {
    "name": "Воробьёв Василий",
    "image": "",
    "text": "Воробьёв Василий — оптик, поступивший в оптическую мастерскую в 1771 году, где обучался и работал под руководством Ивана Петровича Кулибина.",
    "tags": [
      "apprentices"
    ]
  },
  {
    "name": "Воронин Захар",
    "image": "",
    "text": "Воронин Захар — оптик, поступивший в оптическую мастерскую в 1771 году, где обучался и работал под руководством Ивана Петровича Кулибина.",
    "tags": [
      "apprentices"
    ]
  },
  {
    "name": "Воронцов Александр Романович (предполагаемый заказчик часов)",
    "image": "",
    "text": null,
    "tags": [
      "customers"
    ]
  },
  {
    "name": "Вяземский Александр Алексеевич (предполагаемый заказчик часов)",
    "image": "",
    "text": "Вяземский Александр Алексеевич (1727–1796) — петербургский генерал–прокурор, который в 1782 году испытал и одобрил первый экземпляр водохода — судна, оснащённого гребными винтами и якорями для передвижения по мелководью.",
    "tags": [
      "officials",
      "customers"
    ]
  },
  {
    "name": "Гавиньи И. И.",
    "image": "",
    "text": "Гавиньи И. И. (даты жизни неизвестны) — человек неизвестного возраста, которого сын Кулибина, Семен Кулибин, попросил ходатайствовать перед А. К. Разумовским о возвращении или передаче А. Н. Голицыну чертежей проекта металлического моста.",
    "tags": [
      "other"
    ]
  },
  {
    "name": "Гаймен ",
    "image": "",
    "text": "Гаймен (даты жизни неизвестны)  —петербургский часовой мастер, в 1790–х Кулибин получил от него необходимые детали для «часов с павлином». Также, Иван Петрович хотел получить от него «пяток арнольдова маятника» (имеется ввиду 5 штук особых маятников для изготовления часов).",
    "tags": [
      "other"
    ]
  },
  {
    "name": "Голицын (предполагаемый заказчик часов)",
    "image": "",
    "text": null,
    "tags": [
      "customers"
    ]
  },
  {
    "name": "Гурьев Семён Емельянович",
    "image": "",
    "text": "Гурьев Семён Емельянович (1766–1813) — русский профессор и механик, академик Петербургской Академии Наук. Контактировал с Кулибиным по поводу преломления лучей в стёклах с «П.А.С.» (П.А.С.— устаревшая техника обработки стекла, которое применялось в телескопах или микроскопах).",
    "tags": [
      "scientists"
    ]
  },
  {
    "name": "Глебовский (предполагаемый заказчик часов)",
    "image": "",
    "text": null,
    "tags": [
      "customers"
    ]
  },
  {
    "name": "Давыдовы (предполагаемые заказчики часов)",
    "image": "",
    "text": null,
    "tags": [
      "customers"
    ]
  },
  {
    "name": "Дашкова Екатерина Романова (предполагаемая заказчица часов)",
    "image": "",
    "text": "Дашкова Екатерина Романова (1744–1810) — урожденная Воронцова, государственный деятель, директор Петербургской Академии Наук с 1783 по 1794.  Как директор неоднократно контактировала с Кулибиным и принимала решения по его рапортам и проектам. По свидетельствам современников относилась к Кулибину недоброжелательно и способствовала отставке последнего с поста руководителя инструментальных мастерских и уменьшению оклада. ",
    "tags": [
      "scientists",
      "customers"
    ]
  },
  {
    "name": "Демидовы (предполагаемые заказчики часов)",
    "image": "",
    "text": null,
    "tags": [
      "customers"
    ]
  },
  {
    "name": "Державин Гавриил Романович",
    "image": "",
    "text": "Державин Гавриил Романович (1743–1816) — выдающийся поэт и государственный деятель, покровитель Ивана Петровича Кулибина. Восхищённый изобретением Кулибина — усовершенствованным фонарём, он посвятил ему басню «Фонари», в которой сравнил действие обычного фонаря с эффектным освещением, создаваемым устройством Кулибина, отдавая предпочтение новому изобретению.\n\nВдохновлённый инженерным гением Кулибина, Державин также упомянул его фонари в оде «Афинейскому витязю», сравнив изобретателя с Архимедом. \n\nТогда Кулибинский фонарь,\nЧто светел издали, близ темен,\nБыл не во всех местах потребен;\nГорел кристал, горел от зарь...\n\nТакже им написана басня \"Фонари\".\n\nСлучилось паре\nБыть фонарям в амбаре:\nКулибинскому и простому,\nТакому,\nКак ночью в мрачну тень\nС собою носит чернь.\nКулибинский сказал: «Как смеешь, старичишка,\n\nИ стиховторение \"Фонарь\".\n\nНе обавательный ль, волшебный,\nМагический, сей мир, фонарь?\nГде видны тени переменны,\nГде, веселяся ими, царь,\nИль маг какой, волхв непостижный,\nВ своих намереньях обширный,\nПланет круг тайно с высоты\nЕдиным перстом обращает,\nИ земнородных призывает\nМечтами быть, иль зреть мечты!\n\n",
    "tags": [
      "favorite"
    ]
  },
  {
    "name": "Долгов (предполагаемый заказчик часов)",
    "image": "",
    "text": null,
    "tags": [
      "customers"
    ]
  },
  {
    "name": "Домашнев Сергей Герасимович",
    "image": "",
    "text": "Домашнев Сергей Герасимович (1743–1795) — директор Академии наук, которому были представлены результаты предполагаемого испытания модели деревянного моста, спроектированного Иваном Петровичем Кулибиным.",
    "tags": [
      "scientists"
    ]
  },
  {
    "name": "Донской Андрей",
    "image": "",
    "text": "Донской Андрей (даты жизни неизвестны) — мастер Инструментальной мастерской, работавший под руководством Ивана Петровича Кулибина. Основной задачей мастеров было изготовление и ремонт различных приборов и инструментов. ",
    "tags": [
      "other"
    ]
  },
  {
    "name": "Дубянский (предполагаемый заказчик часов)",
    "image": "",
    "text": null,
    "tags": [
      "customers"
    ]
  },
  {
    "name": "Екатерина II",
    "image": "portrait-3.jpg",
    "text": "Екатерина II (1729–1796) — российская императрица. Её связь с Иваном Петровичем Кулибиным началась в 1767 году, когда во время визита в Нижний Новгород он представил ей свои изобретения, включая телескоп, микроскоп и часы в форме яйца, созданные в качестве подарка. Впечатлённая талантом Кулибина, императрица предложила ему возглавить мастерские Академии наук. Высоко оценивая его заслуги, она распорядилась отчеканить медаль с надписью: «Достойному. Академия наук — механику Ивану Кулибину»..",
    "tags": [
      "favorite"
    ]
  },
  {
    "name": "Завадовский Петр Васильевич (предполагаемый заказчик часов)",
    "image": "",
    "text": null,
    "tags": [
      "customers"
    ]
  },
  {
    "name": "Замараев",
    "image": "",
    "text": "Замараев (даты жизни неизвестны)  — купец неизвестного возраста, Кулибин заказывал у него медь, необходимую для создания деталей, которые были использованы в знаменитых фонарях Кулибина.",
    "tags": [
      "other"
    ]
  },
  {
    "name": "Захаров Яков Дмитриевич",
    "image": "",
    "text": "Захаров Яков Дмитриевич (1765–1836) — академик и химик, который, предположительно, взаимодействовал с Иваном Петровичем Кулибиным в рамках научного сообщества своего времени.",
    "tags": [
      "scientists"
    ]
  },
  {
    "name": "Зубов Валериан Александрович (предполагаемый заказчик часов)",
    "image": "",
    "text": "Зубов Валериан Александрович (1771–1804) —  военный деятель, потерявший ногу в 1794 году. По неподтверждённым данным, Иван Петрович Кулибин изготовил для него металлический протез.",
    "tags": [
      "customers",
      "officials"
    ]
  },
  {
    "name": "Зубов Платон Александрович (предполагаемый заказчик часов)",
    "image": "",
    "text": "Зубов Платон Александрович (1767–1822) — военный и государственный деятель, который, по косвенным данным, мог быть связан с административными и военными вопросами, затрагивавшими интересы Ивана Петровича Кулибина. Его брату, Валериану Зубову, Кулибин изготовил протез ноги.",
    "tags": [
      "customers",
      "officials"
    ]
  },
  {
    "name": "Кутайсов Иван Павлович",
    "image": "",
    "text": "Кутайсов Иван Павлович (1759–1834) — фаворит императора Павла I, занимавший при дворе высокие должности и обладавший значительным влиянием. Иван Петрович Кулибин рассчитывал возобновить через него свои ходатайства о поддержке новых изобретений.",
    "tags": [
      "customers"
    ]
  },
  {
    "name": "Иноходцев Петр Борисович",
    "image": "",
    "text": "Иноходцев Петр Борисович (1742–1806) — российский астроном, академик Петербургской академии наук с 1783 года. Он осматривал модель моста Ивана Петровича Кулибина и подписал единогласное свидетельство об её одобрении.",
    "tags": [
      "scientists"
    ]
  },
  {
    "name": "Исленьев Иван Иванович",
    "image": "",
    "text": "Исленьев Иван Иванович (1738–1784) — адъюнкт Академии наук и майор, чья деятельность была связана с организацией и эксплуатацией научного оборудования. Его взаимодействие с Иваном Петровичем Кулибиным касалось ремонта и обслуживания приборов, созданных в рамках академических проектов.",
    "tags": [
      "scientists"
    ]
  },
  {
    "name": "Калмыков Иван Иванович",
    "image": "",
    "text": "Калмыков Иван Иванович (?–1734) — мастер Инструментальной мастерской Академии наук, чьё высокое ремесленное мастерство имело ключевое значение в создании и ремонте сложных механизмов. Предположительно, его опыт и технические навыки сыграли важную роль в реализации проектов Ивана Петровича Кулибина.",
    "tags": [
      "scientists"
    ]
  },
  {
    "name": "Карпов (Сергеев) Егор Карпович",
    "image": "",
    "text": "Карпов (Сергеев) Егор Карпович (1755–1782) — подмастерье мастерской Академии Наук, принимавший участие в технических проектах Кулибина.",
    "tags": [
      "scientists"
    ]
  },
  {
    "name": "Кашталинский Матвей Федорович (предполагаемый заказчик часов)",
    "image": "",
    "text": "Кашталинский Матвей Федорович один из покупателей часов Кулибина.",
    "tags": [
      "customers"
    ]
  },
  {
    "name": "Кваренги Джакомо",
    "image": "",
    "text": "Кваренги Джакомо (1744–1817) — архитектор и живописец, работавший в художественных и строительных кругах. Предположительно сотрудничал с Иваном Петровичем Кулибиным в вопросах архитектурного оформления или эстетического сопровождения его технических проектов.",
    "tags": [
      "foreigners",
      "other"
    ]
  },
  {
    "name": "Кесарев Петр Дмитриевич",
    "image": "",
    "text": "Кесарев Петр Дмитриевич (1739–?) — мастер Инструментальной мастерской, позже механик Академии наук. Предположительно содействовал реализации технических замыслов Ивана Петровича Кулибина.",
    "tags": [
      "scientists"
    ]
  },
  {
    "name": "Клементьев Василий Иванович",
    "image": "",
    "text": "Клементьев Василий Иванович (1732–1759) — ученик и лаборант Михаила Ломоносова, специалист в области технической подготовки фейерверков. Предположительно, он контактировал с Иваном Петровичем Кулибиным через научные круги, объединявшие ведущих специалистов того времени.",
    "tags": [
      "scientists",
      "other"
    ]
  },
  {
    "name": "Козицкий Григорий Васильевич ",
    "image": "",
    "text": "Козицкий Григорий Васильевич (?–1775) — адъюнкт Академии наук, литератор и статс–секретарь Екатерины II. Предположительно, он взаимодействовал с Иваном Петровичем Кулибиным в ходе научно–административной работы при дворе.",
    "tags": [
      "scientists"
    ]
  },
  {
    "name": "Козлов Гавриил Игнатьевич",
    "image": "",
    "text": "Козлов Гавриил Игнатьевич (1738–1791) — живописец, профессор Академии художеств, ректор и директор Петербургской Шпалерной мануфактуры. Иван Петрович Кулибин обращался к нему за консультацией при создании фейерверков.",
    "tags": [
      "scientists"
    ]
  },
  {
    "name": "Козловский Михаил Иванович",
    "image": "",
    "text": "Козловский Михаил Иванович (1753— 1802) — выдающийся скульптор, профессор Академии художеств, прославившийся мастерством в работе с алебастром. Иван Петрович Кулибин, разрабатывая состав прочного алебастра для отражателей фонарей и пиротехнических устройств, обращался к нему за консультацией.",
    "tags": [
      "scientists"
    ]
  },
  {
    "name": "Кокс Джеймс",
    "image": "",
    "text": "Кокс Джеймс (даты жизни неизвестны)  — английский механик–часовщик, прославившийся созданием сложных часовых механизмов с автоматически движущимися фигурами. Автор «Часов с павлином», приобретённых Екатериной II, сборку и восстановление которых доверили Ивану Петровичу Кулибину.",
    "tags": [
      "foreigners",
      "other"
    ]
  },
  {
    "name": "Комаров С.",
    "image": "",
    "text": "Комаров С. (даты жизни неизвестны) — это чиновник, чье имя встречается в различных документах, связанных с деятельностью Ивана Петровича Кулибина. ",
    "tags": [
      "officials"
    ]
  },
  {
    "name": "Комосов",
    "image": "",
    "text": "Комосов (даты жизни неизвестны) — сержант, составивший рапорт о принятии от Ивана Петровича Кулибина казённой квартиры и дворов.",
    "tags": [
      "other"
    ]
  },
  {
    "name": "Костромин Михаил Андреянович",
    "image": "",
    "text": "Костромин Михаил Андреянович (даты жизни неизвестны)— зажиточный нижегородский купец, приятель отца И. П. Кулибина. Михаил Андреянович заприметил талант Кулибина и предложил ему сделать часы, полностью проспонсировав покупку всех необходимых комплектующих, а также расходы на жизнь во время работы над механизмом. На изготовление часов яичной фигуры ушло больше года. Благодаря хлопотам Костромина часы были представлены Екатерине II во время ее посещения Нижнего Новгорода. Часы так понравились императрице, что она пригласила Кулибина в Петербург. ",
    "tags": [
      "favorite"
    ]
  },
  {
    "name": "Котельников Семен Кириллович",
    "image": "",
    "text": "Котельников Семен Кириллович (1723–1806) — академик, математик. Он также состоял в Академии Наук и был в комиссии академиков, смотревших модели мостов Кулибина. ",
    "tags": [
      "scientists"
    ]
  },
  {
    "name": "Кочубей Виктор Павлович",
    "image": "portrait-4.jpg",
    "text": "Виктор Павлович Кочубей (1768–1834) — дипломат и государственный деятель, президент Коллегии иностранных дел (1801–1802), первый министр внутренних дел (1802–1807, 1819–1823). Блестяще образованный человек, он был личным другом Александра I и доверенным лицом Николая I. Ивана Кулибина с Виктором Павловичем связывала рабочая переписка, посвящённая машинным судам.",
    "tags": [
      "officials"
    ]
  },
  {
    "name": "Крафт Логин Юрьевич",
    "image": "portrait-5.jpg",
    "text": "Крафт Логин Юрьевич (1743–1814) — академик, физик, член Академии наук. Он входил в комиссию академиков, которая оценивала модели мостов Кулибина. Как и другие члены комиссии, Крафт изначально скептически относился к успеху изобретателя, но изменил своё мнение, увидев, как модель моста Кулибина выдержала нагрузку более четырёх тысяч пудов",
    "tags": [
      "scientists"
    ]
  },
  {
    "name": "Кулибин Александр Иванович",
    "image": "",
    "text": "Кулибин Александр Иванович (даты жизни неизвестны) –– сын Ивана Петровича Кулибина.",
    "tags": [
      "relatives"
    ]
  },
  {
    "name": "Кулибин Павел Иванович",
    "image": "",
    "text": "Кулибин Павел Иванович (даты жизни неизвестны) –– сын Ивана Петровича Кулибина.",
    "tags": [
      "relatives"
    ]
  },
  {
    "name": "Кулибин Дмитрий Иванович",
    "image": "",
    "text": "Кулибин Дмитрий Иванович (даты жизни неизвестны) –– сын Ивана Петровича Кулибина.",
    "tags": [
      "relatives"
    ]
  },
  {
    "name": "Кулибин Семен Иванович",
    "image": "",
    "text": "Кулибин Семен Иванович (даты жизни неизвестны) –– сын И.П. Кулибина. Семен Иванович, работая статским советником, так же писал о некоторых работах отца и получал от него письма с просьбами о помощи в своей работе(передать чертежи, найти время для представления проекта).Он хотел добиться признания своего отца о чем говорит попытка участия в государрственном конкурсе «о способах ускорения хода речных судов посредством механизации».",
    "tags": [
      "relatives"
    ]
  },
  {
    "name": "Кулибина Ирина Петровна",
    "image": "",
    "text": "Кулибина Ирина Петровна (даты жизни неизвестны) –– сестра Ивана Петровича Кулибина",
    "tags": [
      "relatives"
    ]
  },
  {
    "name": "Куприянова Елизавета Николаевна",
    "image": "",
    "text": "Куприянова Елизавета Николаевна (даты жизни неизвестны) –– праправнучка И. П. Кулибина, у которой государственный исторический музей приобрёл часть рукописей изобретателя.",
    "tags": [
      "relatives"
    ]
  },
  {
    "name": "Кушелев Григорий Григорьевич ",
    "image": "",
    "text": "Кушелев Григорий Григорьевич (1754–1833) — Адмирал, фаворит Павла I, ему были отправлены чертежи нового приспособления для спуска кораблей на воду.",
    "tags": [
      "officials"
    ]
  },
  {
    "name": "Лазарев (предполагаемый заказчик часов)",
    "image": "",
    "text": null,
    "tags": [
      "customers"
    ]
  },
  {
    "name": "Лексель Андрей-Иоанн",
    "image": "",
    "text": " Лексель Андрей–Иоанн (1740–1784) — астроном, один из академиков, подписавших одобрение новой модели деревянного моста, способного выдерживать нагрузку в пятьдесят тысяч пудов. Он также заказывал у Кулибина починку микрометра григорианского телескопа в Академии наук.",
    "tags": [
      "scientists",
      "foreigners"
    ]
  },
  {
    "name": "Ловягин Сергей ",
    "image": "",
    "text": "Ловягин Сергей (даты жизни неизвестны) — градский староста Нижнего Новгорода. В 1807 году он принял на хранение машинное судно, созданное Кулибиным.",
    "tags": [
      "other"
    ]
  },
  {
    "name": "Миклашевский",
    "image": "",
    "text": "Миклашевский (даты жизни неизвестны) — по свидетельству некоторых источников механик. Кулибин получил от него часть деталей для починки часов с автоматическими фигурами, известных как «часы с павлином»",
    "tags": [
      "other"
    ]
  },
  {
    "name": "Михайлов Алексей Лукич (предполагаемый заказчик часов)",
    "image": "",
    "text": null,
    "tags": [
      "customers"
    ]
  },
  {
    "name": "Морган Френсис",
    "image": "",
    "text": "Морган Френсис (даты жизни неизвестны)  — мастер оптических и математических инструментов в Петербурге. Он заказал у Кулибина модель «фундаментальной машины подъёмных и спускных кресел», а также обсуждал с ним вопросы шлифовки оптических стёкол.",
    "tags": [
      "foreigners",
      "customers"
    ]
  },
  {
    "name": "Мусин-Пушкин Алексей Иванович (предполагаемый заказчик часов)",
    "image": "",
    "text": "Мусин-Пушкин Алексей Иванович — предполагаемый заказчик планетных карманных часов, созданных Кулибиным.",
    "tags": [
      "customers"
    ]
  },
  {
    "name": "Маслов Н. И. ",
    "image": "",
    "text": " Маслов Николай Иванович(1734–1804) — сенатор, заказавший солнечные горизонтальные часы с компасом у Академии Наук. Изготовление часов выполнялось в мастерской, которая находилась под руководством Кулибина.",
    "tags": [
      "officials"
    ]
  },
  {
    "name": "Нарышкин Лев Александрович  (предполагаемый заказчик часов)",
    "image": "",
    "text": "Нарышкин Лев Александрович (1733–1799) — заказчик ремонта телескопа и часов. Поддерживал деловые отношения с Кулибиным.",
    "tags": [
      "customers"
    ]
  },
  {
    "name": "Непейцын Сергей Васильевич ",
    "image": "",
    "text": "Непейцын Сергей Васильевич (1771–1848)  — генерал-майор, участник Отечественной войны 1812 года, родился в 1771 году в Псковской губернии. Службу начал в Шляхетском артиллерийском корпусе, а затем участвовал в русско–турецкой войне, где получил тяжелое ранение и лишился ноги. Однако благодаря протезу, изготовленному И.П. Кулибиным, продолжил службу.\nВ Архиве Академии наук СССР есть чертеж протеза для ампутированной ноги — и при нем запись: «Прошлого 1791 года в сентябре месяце по моему указанию сделана одна механическая нога в Санкт–Петербурге артиллерии офицеру Непейцыну, лишившемуся оной в очаковском штурме выше колена…» Кулибин писал, что протез доставил офицеру свободу движений и что выдумка эта будет служить всем раненым, потерявшим руку или ногу.\nНепейцын отличился в боях против Наполеона, проявляя мужество и стратегическое мастерство. Был произведен в полковники, а позже переведен в Семеновские гвардейцы. Участвовал в европейских кампаниях, завершившихся взятием Парижа. Вышел в отставку в чине генерал–майора и скончался в 1848 году в Петербурге.",
    "tags": [
      "customers",
      "officials"
    ]
  },
  {
    "name": "Новосильцов Николай Николаевич",
    "image": "",
    "text": "Новосильцов Николай Николаевич (1761–1836) — президент Академии наук, получавший отчёты от Кулибина. Помимо руководства Академией, он был членом Негласного комитета при Александре I, а также автором Конституции Польши и проекта «Уставной грамоты Российской империи» — первой конституции Российской империи.",
    "tags": [
      "scientists",
      "officials"
    ]
  },
  {
    "name": "Орлов Владимир Григорьевич (предполагаемый заказчик часов)",
    "image": "",
    "text": "Орлов Владимир Григорьевич (1743–1831) — директор Академии Наук, заказывал технические проекты у Кулибина. ",
    "tags": [
      "scientists",
      "customers"
    ]
  },
  {
    "name": "Осокин (предполагаемый заказчик часов)",
    "image": "",
    "text": null,
    "tags": [
      "customers"
    ]
  },
  {
    "name": "Павел I",
    "image": "",
    "text": "Павел I (1796–1801) — император, преемник Екатерины II. Ещё до восшествия на престол он выделял Кулибина за его таланты. После прихода к власти Павел I значительно улучшил положение изобретателя в Академии наук, регулярно поручая ему ответственные задачи. Среди них были ремонт астрономических часов с минутной индикацией и боем, их установка над Зимним дворцом и последующее обслуживание, а также перенос, сборка, установка, ремонт и обслуживание знаменитых часов с павлином, перемещённых из Таврического дворца в Эрмитаж. Для выполнения этих работ Кулибин привлекал вольнонаёмных мастеров, руководя их деятельностью.",
    "tags": [
      "favorite"
    ]
  },
  {
    "name": "Потемкин (предполагаемый заказчик часов)",
    "image": "",
    "text": null,
    "tags": [
      "customers"
    ]
  },
  {
    "name": "Протопопов (предполагаемый заказчик часов)",
    "image": "",
    "text": null,
    "tags": [
      "customers"
    ]
  },
  {
    "name": "Ржевский (предполагаемый заказчик часов)",
    "image": "",
    "text": null,
    "tags": [
      "customers"
    ]
  },
  {
    "name": "Салтыков (предполагаемый заказчик часов)",
    "image": "",
    "text": null,
    "tags": [
      "customers"
    ]
  },
  {
    "name": "Сарти Иосиф",
    "image": "",
    "text": "Сарти Иосиф (?–1802) — почётный член Академии наук, руководитель Певческой капеллы и композитор. Кулибин обратился к Сарти, поскольку тот, будучи почётным академиком, занимался исследованием вибрации органных труб и скрипичных струн.",
    "tags": [
      "scientists"
    ]
  },
  {
    "name": "Солодовников Андрей Иванович",
    "image": "",
    "text": "Солодовников Андрей Иванович (даты жизни неизвестны) — владелец часов, возможно сам являющийся часовщиком. В своих заметках о конструировании часов Кулибин использовал некоторые элементы часов Солодовникова в качестве образца, в частности позаимствовав технологию расположения маятника.",
    "tags": [
      "other"
    ]
  },
  {
    "name": "Строгановы (предполагаемые заказчики часов)",
    "image": "",
    "text": "Строгановы — известная династия русских промышленников и землевладельцев, игравшая важную роль в экономике России с XVI по XX век.\nНачиная с XVIII века, бароны Строгановы являлись крупнейшими владельцами уральских заводов по обработке соли. Одной из главных проблем на их предприятиях была плохая проходимость труб, по которым поступал рассол. Трубы постоянно засорялись, и их приходилось чистить вручную, что значительно замедляло производство.\n\nПосле переезда в провинцию Кулибин оказался в зависимости от местных купцов и предпринимателей. В 1810–1811 годах он узнал о проблеме Строгановых и приступил к разработке «соляной машины». Между Кулибиным и баронами Строгановыми завязалась длительная переписка, в которой обсуждались устройство и принцип работы нового механизма. Изобретатель предоставил баронам подробные чертежи машины, указав все её достоинства и недостатки. Кроме того, он рекомендовал показать чертежи специалистам, «имеющим знание в механике», а затем поручить столичным мастерам создание модели устройства.\n\nКулибин неоднократно отправлял своего сына Александра к Строгановым, передавая с ним новые чертежи и заметки. Прямых свидетельств использования баронами Строгановыми «соляной машины» нет, однако их переписка с Кулибиным позволяет предположить, что проект был реализован. В письмах содержатся детальные описания механизма и уточнения к чертежам, что указывает на практическое применение разработки.",
    "tags": [
      "favorite",
      "customers"
    ]
  },
  {
    "name": "Стрекалов (предполагаемый заказчик часов)",
    "image": "",
    "text": null,
    "tags": [
      "customers"
    ]
  },
  {
    "name": "Сюдерланд (предполагаемый заказчик часов)",
    "image": "",
    "text": null,
    "tags": [
      "customers"
    ]
  },
  {
    "name": "Фалеев (предполагаемый заказчик часов)",
    "image": "",
    "text": null,
    "tags": [
      "customers"
    ]
  },
  {
    "name": "Фоку (предполагаемый заказчик часов)",
    "image": "",
    "text": null,
    "tags": [
      "customers"
    ]
  },
  {
    "name": "Хитров Тимофей",
    "image": "",
    "text": "Хитров Тимофей (даты жизни неизвестны) — выдающийся инженер и механик, автор проекта сооружений для подъёма «Царь–колокола». Взаимодействие с Иваном Петровичем Кулибиным стало значимым этапом его профессиональной деятельности. Под руководством Кулибина он работал в мастерских, где создавались передовые приборы и механизмы.\n\nСотрудничество Кулибина и Хитрова способствовало развитию инженерных технологий того времени.",
    "tags": [
      "scientists",
      "favorite"
    ]
  },
  {
    "name": "Хлебникова (предполагаемая заказчица часов)",
    "image": "",
    "text": null,
    "tags": [
      "customers"
    ]
  },
  {
    "name": "Чернышев (предполагаемый заказчик часов)",
    "image": "",
    "text": null,
    "tags": [
      "customers"
    ]
  },
  {
    "name": "Шерстневский Иван Гаврилович",
    "image": "",
    "text": "Шерстневский Иван Гаврилович (даты жизни неизвестны) — был одним из ближайших учеников и помощников Ивана Петровича Кулибина. Их сотрудничество началось в Нижнем Новгороде, где Шерстневский участвовал в создании первых микроскопов и телескопов. Позже Кулибин взял его с собой в Петербург, где Шерстневский продолжил работу в мастерских Академии наук.\n\nШерстневский упоминается в рапорте Кулибина, в котором тот жалуется на нехватку учеников и просит назначить второго помощника для работы с барометрами и термометрами. В этом документе Шерстневский указан как единственный полноправный ученик Кулибина.\n\nНесмотря на значительный вклад Шерстневского в работу Академии, его жалованье оставалось крайне низким. Условия труда в мастерских были тяжёлыми, что негативно сказывалось на здоровье работников. Многие, включая Шерстневского, часто болели или пропускали работу.\n\nКулибин высоко ценил своего ученика, который помогал ему в создании оптических приборов, таких как телескопы и микроскопы. Дальнейшая судьба Шерстневского после его работы в Академии остаётся неизвестной.",
    "tags": [
      "apprentices",
      "scientists"
    ]
  },
  {
    "name": "Шувалов И.И (предполагаемый заказчик часов)",
    "image": "portrait-6.jpg",
    "text": "Шувалов Иван Иванович (1727–1797) — государственном деятеле и почётном члене Академии наук. Шувалов был известен своей преданностью делу просвещения России и активно поддерживал образованных людей, упоминается в списке предполагаемых покупателей планетных карманных часов, созданных Кулибиным. Сегодня его помнят как одного из основателей Московского университета и Академии художеств.",
    "tags": [
      "customers"
    ]
  },
  {
    "name": "Шувалова (предполагаемая заказчица часов)",
    "image": "",
    "text": null,
    "tags": [
      "customers"
    ]
  },
  {
    "name": "Щербинин (предполагаемый заказчик часов)",
    "image": "",
    "text": null,
    "tags": [
      "customers"
    ]
  },
  {
    "name": "Эйлер Леонард",
    "image": "",
    "text": "Эйлер Леонард (1707–1783) — академик, математик. Лично общался с Иваном Кулибиным. Изучал его однопролётный мост через Неву и одобрил его модель. Среди множества работ Эйлера присутствует та, в которой этот мост рассматривается. Эйлер был одним из немногих, кто верил в успех моста серез Неву. Также Эйлер проверял предложения Кулибина о водоходных судах, общался с Иваном на тему «вечного двигателя», оптики. Кулибин получал от Эйлера заказы на сборку его разработок.",
    "tags": [
      "foreigners",
      "scientists"
    ]
  },
  {
    "name": "Яковлев-Собакин (предполагаемый заказчик часов)",
    "image": "",
    "text": null,
    "tags": [
      "customers"
    ]
  }
];

