export const FILTERS = {
    all: {
        text: "Все",
        default: true,
    },
    favorite: {
        text: "Избранные",
    },
    relatives: {
        text: "Родные",
    },
    apprentices: {
        text: "Ученики",
    },
    scientists: {
        text: "Ученые",
    },
    customers: {
        text: "Заказчики",
    },
    officials: {
        text: "Чиновники",
    },
    foreigners: {
        text: "Иностранцы",
    },
    other: {
        text: "Прочие",
    }
};

export const CONTACTS =
    [
      {
        "name": "Александр I",
        "image": "portrait-1.jpg",
        "text": "Связь Ивана Петровича Кулибина с Александром I началась еще в детстве будущего императора, когда изобретатель по поручению Екатерины II создавал игрушки для ее внуков. Одним из его творений стала механическая мельница с атласными и посеребренными крыльями, приводимая в движение часовым механизмом. В дальнейшем Кулибин обращался к Александру I с прошениями и рапортами, связанными с его проектами мостов. В конце жизни, подавая прошение об отставке из Академии наук, он получил личную аудиенцию у императора, который поблагодарил его за труды и пообещал покрыть его долги, составлявшие 6 тысяч рублей.",
        "tags": ["favorite"]
      },
      {
        "name": "Андрей кузнец",
        "image": "",
        "text": "Кузнец, с которым Иван Петрович Кулибин советовался при создании металлических элементов для мостов.",
        "tags": ["other"]
      },
      {
        "name": "Аракчеев Алексей Андреевич",
        "image": "",
        "text": "Военный министр при Александре I, игравший значительную роль в управлении государством после Отечественной войны 1812 года. Он инициировал создание военных поселений, сочетавших военную службу с сельскохозяйственным трудом для снижения затрат на армию. Однако реформа вызвала широкое недовольство и была впоследствии упразднена. Его имя связывают с термином «Аракчеевщина» — символом жесткой дисциплины и полицейского деспотизма. Иван Петрович Кулибин, не получив ответа на прошение о рассмотрении проекта металлического моста от Александра I, обратился к Аракчееву с просьбой передать его императору.",
        "tags": ["officials"]
      },
      {
        "name": "Барышников",
        "image": "",
        "text": "Предполагаемый заказчик часов",
        "tags": ["customers"]
      },
      {
        "name": "Браницкая Александра Васильевна",
        "image": "",
        "text": "Заказчица металлического кронштейна для установки фонарей",
        "tags": ["customers"]
      },
      {
        "name": "Бриль Адам Иванович",
        "image": "",
        "text": "Генерал–поручик и иркутский губернатор, сыграл важную роль в развитии региона. Приехав в Иркутск из Петербурга в 1767 году, он активно занимался улучшением инфраструктуры и поддержкой научных исследований. Предоставил Кулибину метеорологические данные, включая информацию о барометрах, необходимые для разработки новых приборов и улучшения точности метеорологических наблюдений.",
        "tags": ["customers"]
      },
      {
        "name": "Брюс (вероятно, Яков Александрович)",
        "image": "",
        "text": "Предполагаемый заказчик часов",
        "tags": ["customers"]
      },
      {
        "name": "Буссе Иван Фомич",
        "image": "",
        "text": "Унтер–библиотекарь, отвечавший за сохранность и работу часов в форме яйца после отъезда Ивана Петровича Кулибина из Петербурга в Нижний Новгород.",
        "tags": ["customers"]
      },
      {
        "name": "Буш Иван Фёдорович",
        "image": "portrait-2.jpg",
        "text": "Академик, заведующий кафедрой хирургии Медико–хирургической академии, высоко оценивший протез ноги, разработанный Иваном Петровичем Кулибиным.",
        "tags": ["officials"]
      },
      {
        "name": "Орлов Владимир Григорьевич",
        "image": "",
        "text": "Директор Академии наук, заказывавший у Ивана Петровича Кулибина разработку технических проектов.",
        "tags": ["customers"]
      },
      {
        "name": "Владимиров",
        "image": "",
        "text": "Предполагаемый заказчик часов",
        "tags": ["other"]
      },
      {
        "name": "Воробьёв Василий",
        "image": "",
        "text": "Оптик, поступивший в оптическую мастерскую в 1771 году, где обучался и работал под руководством Ивана Петровича Кулибина.",
        "tags": ["scientists"]
      },
      {
        "name": "Воронин Захар",
        "image": "",
        "text": "Оптик, поступивший в оптическую мастерскую в 1771 году, где обучался и работал под руководством Ивана Петровича Кулибина.",
        "tags": ["customers"]
      },
      {
        "name": "Воронцов (вероятно, Александр Романович)",
        "image": "",
        "text": "Предполагаемый заказчик часов",
        "tags": ["apprentices"]
      },
      {
        "name": "Вяземский Александр Алексеевич",
        "image": "",
        "text": "Петербургский генерал–прокурор (1727–1796), который в 1782 году испытал и одобрил первый экземпляр водохода — судна, оснащённого гребными винтами и якорями для передвижения по мелководью.",
        "tags": ["apprentices"]
      },
      {
        "name": "Гавиньи И. И.",
        "image": "",
        "text": "Семен Кулибин (сын И.П.Кулибина) в письме Гавиньи просил ходатайствовать перед А.К.Разумовским о возвращении или передаче А.Н.Голицыну чертежей проекта металлического моста.",
        "tags": ["customers"]
      },
      {
        "name": "Гаймен",
        "image": "",
        "text": "Петербургский часовой мастер, в 1790–х Кулибин получил от него необходимые детали для «часов с павлином». Также, Иван Петрович хотел получить от него «пяток арнольдова маятника»(имеется ввиду 5 штук особых маятников для изготовления часов).",
        "tags": ["officials", "customers"]
      },
      {
        "name": "Кушелев Григорий Григорьевич",
        "image": "",
        "text": "Кушелев Григорий Григорьевич (1754 — 1833) — Адмирал, фаворит Павла I, ему были отправлены чертежи нового приспособления для спуска кораблей на воду.",
        "tags": ["other"]
      },
      {
        "name": "Гурьев Семён Емельянович",
        "image": "",
        "text": "Гурьев Семён Емельянович (1766-1813) — Русский профессор и механик. Академик Петербургской АН. Контактировал с Кулибиным по поводу преломления лучей в стёклах с «П. А. С.» (П.А.С.— устаревшая техника обработки стекла, которое применялось в телескопах или микроскопах)",
        "tags": ["other"]
      },
      {
        "name": "Давыдовы",
        "image": "",
        "text": "Предполагаемый заказчик часов",
        "tags": ["customers"]
      },
      {
        "name": "Дашкова Екатерина Романовна",
        "image": "",
        "text": "(1744–1810) Урожденная Воронцова, государственный деятель, директор Петербургской АН с 1783 по 1794. Как директор АН неоднократно контактировала с Кулибиным, и принимала решения по его рапортам и проектам. По свидетельствам современников относилась к Кулибину недоброжелательно и способствовала отставке последнего с поста руководителя инструментальных мастерских и уменьшению оклада.",
        "tags": ["scientists"]
      },
      {
        "name": "Демидовы",
        "image": "",
        "text": "Предполагаемый заказчик часов",
        "tags": ["customers"]
      },
      {
        "name": "Державин Гавриил Романович",
        "image": "",
        "text": "Гавриил Романович Державин (1743–1816) — выдающийся поэт и государственный деятель, покровитель Ивана Петровича Кулибина. Восхищённый изобретением Кулибина — усовершенствованным фонарём, он посвятил ему басню «Фонари», в которой сравнил действие обычного фонаря с эффектным освещением, создаваемым устройством Кулибина, отдавая предпочтение новому изобретению. Вдохновлённый инженерным гением Кулибина, Державин также упомянул его фонари в оде «Афинейскому витязю», сравнив изобретателя с Архимедом.",
        "tags": ["customers"]
      },
      {
        "name": "Долгов",
        "image": "",
        "text": "Предполагаемый заказчик часов",
        "tags": ["scientists", "customers"]
      },
      {
        "name": "Домашнев Сергей Герасимович",
        "image": "",
        "text": "Сергей Герасимович Домашнев (1743–1795) — директор Академии наук, которому были представлены результаты предполагаемого испытания модели деревянного моста, спроектированного Иваном Петровичем Кулибиным.",
        "tags": ["customers"]
      },
      {
        "name": "Донской Андрей",
        "image": "",
        "text": "Андрей Донской — мастер Инструментальной мастерской, работавший под руководством Ивана Петровича Кулибина. Основной задачей мастеров было изготовление и ремонт различных приборов и инструментов.",
        "tags": ["favorite"]
      },
      {
        "name": "Дубянский",
        "image": "",
        "text": "Предполагаемый покупатель карманных планетных часов",
        "tags": ["customers"]
      },
      {
        "name": "Екатерина II",
        "image": "portrait-3.jpg",
        "text": "Екатерина II (21 апреля [2 мая] 1729 – 6 [17] ноября 1796) — российская императрица. Её связь с Иваном Петровичем Кулибиным началась в 1767 году, когда во время визита в Нижний Новгород он представил ей свои изобретения, включая телескоп, микроскоп и часы в форме яйца, созданные в качестве подарка. Впечатлённая талантом Кулибина, императрица предложила ему возглавить мастерские Академии наук. Высоко оценивая его заслуги, она распорядилась отчеканить медаль с надписью: «Достойному. Академия наук — механику Ивану Кулибину».",
        "tags": ["scientists"]
      },
      {
        "name": "Завадовский Петр Васильевич",
        "image": "",
        "text": "Заказчик часов",
        "tags": ["other"]
      },
      {
        "name": "Замараев",
        "image": "",
        "text": "Замараев — купец, Кулибин заказывал у него медь, необходимую для создания деталей, которые были использованы в знаменитых фонарях Кулибина.",
        "tags": ["customers"]
      },
      {
        "name": "Захаров Яков Дмитриевич",
        "image": "",
        "text": "Яков Дмитриевич Захаров — академик и химик, который, предположительно, взаимодействовал с Иваном Петровичем Кулибиным в рамках научного сообщества своего времени.",
        "tags": ["favorite"]
      },
      {
        "name": "Зубов Валериан Александрович",
        "image": "",
        "text": "Валериан Александрович Зубов (1771–1804) — военный деятель, потерявший ногу в 1794 году. По неподтверждённым данным, Иван Петрович Кулибин изготовил для него металлический протез.",
        "tags": ["customers"]
      },
      {
        "name": "Зубов Платон Александрович",
        "image": "",
        "text": "Платон Александрович Зубов — военный и государственный деятель, который, по косвенным данным, мог быть связан с административными и военными вопросами, затрагивавшими интересы Ивана Петровича Кулибина. Его брату, Валериану Зубову, Кулибин изготовил протез ноги.",
        "tags": ["other"]
      },
      {
        "name": "Кутайсов Иван Павлович",
        "image": "",
        "text": "Иван Павлович Кутайсов (1759–1834) — фаворит императора Павла I, занимавший при дворе высокие должности и обладавший значительным влиянием. Иван Петрович Кулибин рассчитывал возобновить через него свои ходатайства о поддержке новых изобретений.",
        "tags": ["scientists"]
      },
      {
        "name": "Иноходцев Петр Борисович",
        "image": "",
        "text": "Пётр Борисович Иноходцев (1742–1806) — российский астроном, академик Петербургской академии наук с 1783 года. Он осматривал модель моста Ивана Петровича Кулибина и подписал единогласное свидетельство об её одобрении.",
        "tags": ["customers", "officials"]
      },
      {
        "name": "Исленьев Иван Иванович",
        "image": "",
        "text": "Адъюнкт Академии наук и майор, чья деятельность была связана с организацией и эксплуатацией научного оборудования. Его взаимодействие с Иваном Петровичем Кулибиным касалось ремонта и обслуживания приборов, созданных в рамках академических проектов.",
        "tags": ["customers", "officials"]
      },
      {
        "name": "Калмыков Иван Иванович",
        "image": "",
        "text": "Мастер Инструментальной мастерской Академии наук, чьё высокое ремесленное мастерство имело ключевое значение в создании и ремонте сложных механизмов. Предположительно, его опыт и технические навыки сыграли важную роль в реализации проектов Ивана Петровича Кулибина.",
        "tags": ["customers"]
      },
      {
        "name": "Карпов (Сергеев) Егор Карпович",
        "image": "",
        "text": "Подмастерье мастерской Академии Наук, принимавший участие в технических проектах Кулибина.",
        "tags": ["scientists"]
      },
      {
        "name": "Кашталинский Матвей Федорович",
        "image": "",
        "text": "Покупатель часов.",
        "tags": ["scientists"]
      },
      {
        "name": "Кваренги Джакомо",
        "image": "",
        "text": "Архитектор и живописец, работавший в художественных и строительных кругах. Предположительно сотрудничал с Иваном Петровичем Кулибиным в вопросах архитектурного оформления или эстетического сопровождения его технических проектов.",
        "tags": ["scientists"]
      },
      {
        "name": "Кесарев Петр Дмитриевич",
        "image": "",
        "text": "Мастер Инструментальной мастерской, позже механик Академии наук. Предположительно содействовал реализации технических замыслов Ивана Петровича Кулибина.",
        "tags": ["customers"]
      },
      {
        "name": "Клементьев Василий Иванович",
        "image": "",
        "text": "Ученик и лаборант Михаила Ломоносова, специалист в области технической подготовки фейерверков. Предположительно, он контактировал с Иваном Петровичем Кулибиным через научные круги, объединявшие ведущих специалистов того времени.",
        "tags": ["foreigners", "other"]
      },
      {
        "name": "Козицкий Григорий Васильевич",
        "image": "",
        "text": "Адъюнкт Академии наук, литератор и статс–секретарь Екатерины II. Предположительно, он взаимодействовал с Иваном Петровичем Кулибиным в ходе научно–административной работы при дворе.",
        "tags": ["scientists"]
      },
      {
        "name": "Козлов Гавриил Игнатьевич",
        "image": "",
        "text": "Гавриил Игнатьевич Козлов (1738–1791) — живописец, профессор Академии художеств, ректор и директор Петербургской Шпалерной мануфактуры. Иван Петрович Кулибин обращался к нему за консультацией при создании фейерверков.",
        "tags": ["scientists", "other"]
      },
      {
        "name": "Козловский Михаил Иванович",
        "image": "",
        "text": "Михаил Иванович Козловский (1753–1802) — выдающийся скульптор, профессор Академии художеств, прославившийся мастерством в работе с алебастром. Иван Петрович Кулибин, разрабатывая состав прочного алебастра для отражателей фонарей и пиротехнических устройств, обращался к нему за консультацией.",
        "tags": ["scientists"]
      },
      {
        "name": "Кокс Джеймс",
        "image": "",
        "text": "Английский механик–часовщик, прославившийся созданием сложных часовых механизмов с автоматически движущимися фигурами. Автор «Часов с павлином», приобретённых Екатериной II, сборку и восстановление которых доверили Ивану Петровичу Кулибину.",
        "tags": ["scientists"]
      },
      {
        "name": "Комаров С.",
        "image": "",
        "text": "Чиновник, чье имя встречается в различных документах, связанных с деятельностью Ивана Петровича Кулибина.",
        "tags": ["scientists"]
      },
      {
        "name": "Комосов",
        "image": "",
        "text": "Сержант, составивший рапорт о принятии от Ивана Петровича Кулибина казённой квартиры и дворов.",
        "tags": ["foreigners", "other"]
      },
      {
        "name": "Костромин Михаил Андреянович",
        "image": "",
        "text": "Костромин Михаил Андреянович — зажиточный нижегородский купец, приятель отца И. П. Кулибина. Михаил Андреянович заприметил талант Кулибина и предложил ему сделать часы, полностью проспонсировав покупку всех необходимых комплектующих, а также расходы на жизнь во время работы над механизмом. На изготовление часов яичной фигуры ушло больше года. Благодаря хлопотам Костромина часы были представлены Екатерине II во время ее посещения Нижнего Новгорода. Часы так понравились императрице, что она пригласила Кулибина в Петербург. ",
        "tags": ["officials"]
      },
      {
        "name": "Котельников Семен Кириллович",
        "image": "",
        "text": "Котельников Семен Кириллович (1723–1806) — академик, математик. Он также состоял в Академии Наук и был в комиссии академиков, смотревших модели мостов Кулибина.",
        "tags": ["other"]
      },
      {
        "name": "Кочубей Виктор Павлович",
        "image": "portrait-4.jpg",
        "text": "Виктор Павлович Кочубей (1768–1834) — дипломат и государственный деятель, президент Коллегии иностранных дел (1801–1802), первый министр внутренних дел (1802–1807, 1819–1823). Блестяще образованный человек, он был личным другом Александра I и доверенным лицом Николая I. Ивана Кулибина с Виктором Павловичем связывала рабочая переписка, посвящённая машинным судам.",
        "tags": ["favorite"]
      },
      {
        "name": "Крафт Логин Юрьевич",
        "image": "portrait-5.jpg",
        "text": "Логин Юрьевич Крафт (1743–1814) — академик, физик, член Академии наук. Он входил в комиссию академиков, которая оценивала модели мостов Кулибина. Как и другие члены комиссии, Крафт изначально скептически относился к успеху изобретателя, но изменил своё мнение, увидев, как модель моста Кулибина выдержала нагрузку более четырёх тысяч пудов",
        "tags": ["scientists"]
      },
      {
        "name": "Кулибин Александр Иванович, Дмитрий Иванович, Павел Иванович, Семен Иванович",
        "image": "",
        "text": "Сыновья Ивана Петровича Кулибина поддерживали связь с отцом. Семён Иванович, работавший статским советником, писал о некоторых работах Кулибина–старшего и получал от него письма с просьбами о помощи: передать чертежи, найти время для представления проектов. Стремясь добиться признания отца, Семён Иванович предпринял попытку участия в государственном конкурсе «о способах ускорения хода речных судов посредством механизации».",
        "tags": ["officials"]
      },
      {
        "name": "Кулибина Ирина Петровна",
        "image": "",
        "text": "Сестра И.П.Кулибина",
        "tags": ["scientists"]
      },
      {
        "name": "Куприянова Елизавета Николаевна",
        "image": "",
        "text": "Праправнучка И.П.Кулибина, у которой государственный исторический музей приобрёл часть рукописей изобретателя.",
        "tags": ["relatives"]
      },
      {
        "name": "Лазарев Г.",
        "image": "",
        "text": "Предполагаемый заказчик часов",
        "tags": ["relatives"]
      },
      {
        "name": "Нарышкин Лев Александрович",
        "image": "",
        "text": "Заказчик ремонта телескопа и часов. Поддерживал деловые отношения с Кулибиным.",
        "tags": ["relatives"]
      },
      {
        "name": "Лексель Андрей-Иоанн",
        "image": "",
        "text": "Андрей-Иоанн Лексель (1740–1784) — астроном, один из академиков, подписавших одобрение новой модели деревянного моста, способного выдерживать нагрузку в пятьдесят тысяч пудов. Он также заказывал у Кулибина починку микрометра григорианского телескопа в Академии наук.",
        "tags": ["relatives"]
      },
      {
        "name": "Михайлов Алексей Лукич",
        "image": "",
        "text": "Предполагаемый заказчик часов",
        "tags": ["relatives"]
      },
      {
        "name": "Морган Френсис",
        "image": "",
        "text": "Мастер оптических и математических инструментов в Петербурге. Он заказал у Кулибина модель «фундаментальной машины подъёмных и спускных кресел», а также обсуждал с ним вопросы шлифовки оптических стёкол.",
        "tags": ["officials"]
      },
      {
        "name": "Мусин-Пушкин Алексей Иванович",
        "image": "",
        "text": "Предполагаемый заказчик планетных карманных часов, созданных Кулибиным.",
        "tags": ["customers"]
      },
      {
        "name": "Маслов Н. И.",
        "image": "",
        "text": "Николай Иванович Маслов (1734–1804) — сенатор, заказавший солнечные горизонтальные часы с компасом у Академии Наук. Изготовление часов выполнялось в мастерской, которая находилась под руководством Кулибина.",
        "tags": ["scientists", "foreigners"]
      },
      {
        "name": "Непейцын Сергей Васильевич",
        "image": "",
        "text": "Офицер, генерал–майор, ставший первым, кто использовал протез, изобретённый Кулибиным.",
        "tags": ["other"]
      },
      {
        "name": "Новосильцов Николай Николаевич",
        "image": "",
        "text": "Президент Академии наук, получавший отчёты от Кулибина. Помимо руководства Академией, он был членом Негласного комитета при Александре I, а также автором Конституции Польши и проекта «Уставной грамоты Российской империи» — первой конституции Российской империи.",
        "tags": ["other"]
      },
      {
        "name": "Осокин",
        "image": "",
        "text": "Предполагаемый заказчик часов",
        "tags": ["customers"]
      },
      {
        "name": "Павел I",
        "image": "",
        "text": "Павел I (1796–1801) — император, преемник Екатерины II. Ещё до восшествия на престол он выделял Кулибина за его таланты. После прихода к власти Павел I значительно улучшил положение изобретателя в Академии наук, регулярно поручая ему ответственные задачи. Среди них были ремонт астрономических часов с минутной индикацией и боем, их установка над Зимним дворцом и последующее обслуживание, а также перенос, сборка, установка, ремонт и обслуживание знаменитых часов с павлином, перемещённых из Таврического дворца в Эрмитаж. Для выполнения этих работ Кулибин привлекал вольнонаёмных мастеров, руководя их деятельностью.",
        "tags": ["foreigners", "customers"]
      },
      {
        "name": "Протопопов",
        "image": "",
        "text": "Предполагаемый заказчик часов",
        "tags": ["customers"]
      },
      {
        "name": "Сарти Иосиф",
        "image": "",
        "text": "Иосиф Сарти (ум. в 1802 г.) — почётный член Академии наук, руководитель Певческой капеллы и композитор. Кулибин обратился к Сарти, поскольку тот, будучи почётным академиком, занимался исследованием вибрации органных труб и скрипичных струн.",
        "tags": ["officials"]
      },
      {
        "name": "Ловягин Сергей",
        "image": "",
        "text": "Градский староста Нижнего Новгорода. В 1807 году он принял на хранение машинное судно, созданное Кулибиным.",
        "tags": ["customers"]
      },
      {
        "name": "Солодовников Андрей Иванович",
        "image": "",
        "text": "Владелец часов, возможно сам являющийся часовщиком. В своих заметках о конструировании часов Кулибин использовал некоторые элементы часов Солодовникова в качестве образца, в частности позаимствовав технологию расположения маятника.",
        "tags": ["customers", "officials"]
      },
      {
        "name": "Строгановы",
        "image": "",
        "text": "Строгановы — известная династия русских промышленников и землевладельцев, игравшая важную роль в экономике России с XVI по XX век. Начиная с XVIII века, бароны Строгановы являлись крупнейшими владельцами уральских заводов по обработке соли. Одной из главных проблем на их предприятиях была плохая проходимость труб, по которым поступал рассол. Трубы постоянно засорялись, и их приходилось чистить вручную, что значительно замедляло производство. После переезда в провинцию Кулибин оказался в зависимости от местных купцов и предпринимателей. В 1810–1811 годах он узнал о проблеме Строгановых и приступил к разработке «соляной машины». Между Кулибиным и баронами Строгановыми завязалась длительная переписка, в которой обсуждались устройство и принцип работы нового механизма. Изобретатель предоставил баронам подробные чертежи машины, указав все её достоинства и недостатки. Кроме того, он рекомендовал показать чертежи специалистам, «имеющим знание в механике», а затем поручить столичным мастерам создание модели устройства. Кулибин неоднократно отправлял своего сына Александра к Строгановым, передавая с ним новые чертежи и заметки. Прямых свидетельств использования баронами Строгановыми «соляной машины» нет, однако их переписка с Кулибиным позволяет предположить, что проект был реализован. В письмах содержатся детальные описания механизма и уточнения к чертежам, что указывает на практическое применение разработки.",
        "tags": ["scientists", "officials"]
      },
      {
        "name": "Сюдерланд",
        "image": "",
        "text": "Предполагаемый заказчик часов",
        "tags": ["scientists", "customers"]
      },
      {
        "name": "Фалеев",
        "image": "",
        "text": "Предполагаемый заказчик часов",
        "tags": ["customers"]
      },
      {
        "name": "Хитров Тимофей",
        "image": "",
        "text": "Выдающийся инженер и механик, автор проекта сооружений для подъёма «Царь–колокола». Взаимодействие с Иваном Петровичем Кулибиным стало значимым этапом его профессиональной деятельности. Под руководством Кулибина он работал в мастерских, где создавались передовые приборы и механизмы. Сотрудничество Кулибина и Хитрова способствовало развитию инженерных технологий того времени.",
        "tags": ["favorite"]
      },
      {
        "name": "Хлебникова",
        "image": "",
        "text": "Предполагаемый заказчик часов",
        "tags": ["customers"]
      },
      {
        "name": "Шерстневский Иван Гаврилович",
        "image": "",
        "text": "Иван Шерстневский был одним из ближайших учеников и помощников Ивана Петровича Кулибина. Их сотрудничество началось в Нижнем Новгороде, где Шерстневский участвовал в создании первых микроскопов и телескопов. Позже Кулибин взял его с собой в Петербург, где Шерстневский продолжил работу в мастерских Академии наук. Шерстневский упоминается в рапорте Кулибина, в котором тот жалуется на нехватку учеников и просит назначить второго помощника для работы с барометрами и термометрами. В этом документе Шерстневский указан как единственный полноправный ученик Кулибина. Несмотря на значительный вклад Шерстневского в работу Академии, его жалованье оставалось крайне низким. Условия труда в мастерских были тяжёлыми, что негативно сказывалось на здоровье работников. Многие, включая Шерстневского, часто болели или пропускали работу. Кулибин высоко ценил своего ученика, который помогал ему в создании оптических приборов, таких как телескопы и микроскопы. Дальнейшая судьба Шерстневского после его работы в Академии остаётся неизвестной.",
        "tags": ["customers"]
      },
      {
          "name": "Шувалов И.И",
          "image": "portrait-6.jpg",
          "text": "Имя Шувалова упоминается в списке предполагаемых покупателей планетных карманных часов, созданных Кулибиным. Скорее всего, речь идёт об Иване Ивановиче Шувалове (1727–1797) — государственном деятеле и почётном члене Академии наук. Шувалов был известен своей преданностью делу просвещения России и активно поддерживал образованных людей. Сегодня его помнят как одного из основателей Московского университета и Академии художеств.",
          "tags": ["customers"]
      }
]
