<script>
    import BiographyPoint from '$lib/components/BiographyPoint.svelte';
</script>

<main class="p-4">
<h1 class="text-2xl font-bold mb-4">Демонстрация компонента BiographyPoint</h1>
<BiographyPoint year="1337">
    <div>
        <a href="https://google.com">DADAON</a>
    </div>
</BiographyPoint>
<BiographyPoint year="2025">
    <img src="https://www.alleycat.org/wp-content/uploads/2019/03/FELV-cat.jpg" alt="KOTIK" />
</BiographyPoint>
<BiographyPoint year="1735">
    <div>Пётр Иванович не счёл нужным отправить сына в школу, поручив его
        обучение местному дьяку. Иван быстро освоил грамоту, и вскоре начал помогать отцу за прилавком. Однако торговля его не привлекала — куда больше Ивана интересовали книги и создание разных механизмов. Ещё в детстве он смастерил из дерева маленькую, но сложную модель водяной мукомольной мельницы с вращающимися жерновами, используя обычный карманный нож.
        Отец, однако, не одобрял этих занятий, находя их лишь напрасной тратой времени. Он с досадой ломал искусно выполненные Иваном изделия, запрещая ему прикасаться к инструментам. Видя в сыне будущего купца, продолжателя своего рода, он не мог разглядеть пользы в этих детских поделках и всячески старался искоренить это увлечение.</div>
    
    <div style="margin-top: 50px">Пётр Иванович не счёл нужным отправить сына в школу, поручив его
            обучение местному дьяку. Иван быстро освоил грамоту, и вскоре начал помогать отцу за прилавком. Однако торговля его не привлекала — куда больше Ивана интересовали книги и создание разных механизмов. Ещё в детстве он смастерил из дерева маленькую, но сложную модель водяной мукомольной мельницы с вращающимися жерновами, используя обычный карманный нож.
            Отец, однако, не одобрял этих занятий, находя их лишь напрасной тратой времени. Он с досадой ломал искусно выполненные Иваном изделия, запрещая ему прикасаться к инструментам. Видя в сыне будущего купца, продолжателя своего рода, он не мог разглядеть пользы в этих детских поделках и всячески старался искоренить это увлечение.</div>
</BiographyPoint>
<BiographyPoint year="1735">
    <p>Пётр Иванович не счёл нужным отправить сына в школу, поручив его
        обучение местному дьяку. Иван быстро освоил грамоту, и вскоре начал помогать отцу за прилавком. Однако торговля его не привлекала — куда больше Ивана интересовали книги и создание разных механизмов. Ещё в детстве он смастерил из дерева маленькую, но сложную модель водяной мукомольной мельницы с вращающимися жерновами, используя обычный карманный нож.
        Отец, однако, не одобрял этих занятий, находя их лишь напрасной тратой времени. Он с досадой ломал искусно выполненные Иваном изделия, запрещая ему прикасаться к инструментам. Видя в сыне будущего купца, продолжателя своего рода, он не мог разглядеть пользы в этих детских поделках и всячески старался искоренить это увлечение.</p>
</BiographyPoint>
<BiographyPoint year="1735">
    <p>Пётр Иванович не счёл нужным отправить сына в школу, поручив его
        обучение местному дьяку. Иван быстро освоил грамоту, и вскоре начал помогать отцу за прилавком. Однако торговля его не привлекала — куда больше Ивана интересовали книги и создание разных механизмов. Ещё в детстве он смастерил из дерева маленькую, но сложную модель водяной мукомольной мельницы с вращающимися жерновами, используя обычный карманный нож.
        Отец, однако, не одобрял этих занятий, находя их лишь напрасной тратой времени. Он с досадой ломал искусно выполненные Иваном изделия, запрещая ему прикасаться к инструментам. Видя в сыне будущего купца, продолжателя своего рода, он не мог разглядеть пользы в этих детских поделках и всячески старался искоренить это увлечение.</p>
</BiographyPoint>
<BiographyPoint year="1735">
    <p>Пётр Иванович не счёл нужным отправить сына в школу, поручив его
        обучение местному дьяку. Иван быстро освоил грамоту, и вскоре начал помогать отцу за прилавком. Однако торговля его не привлекала — куда больше Ивана интересовали книги и создание разных механизмов. Ещё в детстве он смастерил из дерева маленькую, но сложную модель водяной мукомольной мельницы с вращающимися жерновами, используя обычный карманный нож.
        Отец, однако, не одобрял этих занятий, находя их лишь напрасной тратой времени. Он с досадой ломал искусно выполненные Иваном изделия, запрещая ему прикасаться к инструментам. Видя в сыне будущего купца, продолжателя своего рода, он не мог разглядеть пользы в этих детских поделках и всячески старался искоренить это увлечение.</p>
</BiographyPoint>
</main>