<script>
    import { base } from '$app/paths';
    import Slider from '$lib/components/Slider.svelte';
    
    const slides = [
  {
    title: "Элиша Оттис (1811–1861), США",
    text: '<p>Элиша Оттис сыграл важную роль в истории лифтов: в 1853 году он представил первый безопасный лифт, оснащённый устройством, которое предотвращало падение кабины в случае обрыва троса. Это изобретение стало серьёзным прорывом в инженерии, значительно повысило уровень безопасности и открыло возможности для строительства высотных зданий.</p><p>Ранее над созданием подъёмных механизмов работал и Кулибин. Для своего времени его работы заложили основу для дальнейшего развития таких технологий. Позднее идеи подъёмных устройств получили развитие в трудах других инженеров, например, Роберта Фултона.</p><p>Таким образом, можно провести параллели между изобретателями Кулибиным, Фултоном и Оттисом. Все они решали задачи, связанные с подъёмом и перемещением грузов, используя принципы механики. Однако если Кулибин сосредоточился на экспериментировании и использовании необычных инженерных решений, то Оттис сделал акцент на безопасности и надёжности — критически важных качествах, которые позволили лифтам массово войти в городскую архитектуру.</p>'
}
];
</script>

<Slider {slides} />

<div class="container">
    <h1 class="title">«Подъемные кресла» (лифт)</h1>
    <p>В конце XVIII века Иван Кулибин разработал механизм, позволявший поднимать человека на верхние этажи без использования лестниц. Его конструкция, созданная для удобства передвижения по дворцовым помещениям, стала одним из ранних прообразов современного лифта.</p>
    <p>Идея подъема людей и грузов существовала задолго до Кулибина. В древнем Риме для этой цели применялись примитивные устройства на основе блоков и канатов, приводимые в движение мускульной силой. В средневековых замках встречались механизмы для перемещения грузов между этажами. Однако полноценные лифтовые конструкции оставались редкостью вплоть до XVIII века.</p>
    <p>Екатерина II пожелала иметь устройство, которое позволяло бы ей перемещаться между этажами дворца без необходимости подниматься по лестнице.</p>
    <p>Разработанный для решения этой задачи Кулибиным механизм представлял собой подъемное кресло, которое помещалось на гайки. Эти гайки двигались по двум вертикально установленным столбам. Несколько рабочих, сидящих за кабиной, приводили в действие механизм, вращая гайки с помощью системы шестерен. Такое устройство плавно и безопасно поднимало императрицу на верхние этажи дворца.</p>
    <p>Кулибин применил несколько передовых для своего времени инженерных решений. Важным новшеством стали подшипники (чем-то похожие на те, которые используются в современных машинах), которые уменьшали трение в механизме. В качестве смазки изобретатель использовал графит, а не сало, как было принято. Дополнительно была продумана система безопасности: в случае обрыва противовеса устройство должно было автоматически останавливать движение, предотвращая падение кресла.</p>
</div>

<style>
    .container {
        margin: 0;
        padding: 0;

        justify-content: center;
        align-items: center;
        height: 100vh;

        padding: 20px;
        max-width: 1000px;
        width: 100%;
    }

    .title {
        font-size: 38px;
        color: #000957;
        text-align: center;
        line-height: 1.1;
        font-weight: bold;
        margin-bottom: 25px;
    }

    p {
        color: #000000;
        line-height: 1.6;
        margin-bottom: 15px;
    }

    @media screen and (max-width: 330px) {
        .title {
            font-size: 34px;
        }
    }

</style>
