<div class="container">
    <h1 class="title">«Подъемные кресла» (лифт)</h1>
    <p>В конце XVIII века Иван Кулибин разработал механизм, позволявший поднимать человека на верхние этажи без использования лестниц. Его конструкция, созданная для удобства передвижения по дворцовым помещениям, стала одним из ранних прообразов современного лифта.</p>
    <p>Идея подъема людей и грузов существовала задолго до Кулибина. В древнем Риме для этой цели применялись примитивные устройства на основе блоков и канатов, приводимые в движение мускульной силой. В средневековых замках встречались механизмы для перемещения грузов между этажами. Однако полноценные лифтовые конструкции оставались редкостью вплоть до XVIII века.</p>
    <p>Екатерина II пожелала иметь устройство, которое позволяло бы ей перемещаться между этажами дворца без необходимости подниматься по лестнице.</p>
    <p>Разработанный для решения этой задачи Кулибиным механизм представлял собой подъемное кресло, которое помещалось на гайки. Эти гайки двигались по двум вертикально установленным столбам. Несколько рабочих, сидящих за кабиной, приводили в действие механизм, вращая гайки с помощью системы шестерен. Такое устройство плавно и безопасно поднимало императрицу на верхние этажи дворца.</p>
    <p>Кулибин применил несколько передовых для своего времени инженерных решений. Важным новшеством стали подшипники (чем-то похожие на те, которые используются в современных машинах), которые уменьшали трение в механизме. В качестве смазки изобретатель использовал графит, а не сало, как было принято. Дополнительно была продумана система безопасности: в случае обрыва противовеса устройство должно было автоматически останавливать движение, предотвращая падение кресла.</p>
</div>

<style>
    .container {
        margin: 0;
        padding: 0;

        justify-content: center;
        align-items: center;
        height: 100vh;

        padding: 20px;
        max-width: 1000px;
        width: 100%;
    }

    .title {
        font-size: 38px;
        color: #000957;
        text-align: center;
        line-height: 1.1;
        font-weight: bold;
        margin-bottom: 25px;
    }

    p {
        color: #000000;
        line-height: 1.6;
        margin-bottom: 15px;
    }

    @media screen and (max-width: 330px) {
        .title {
            font-size: 34px;
        }
    }

</style>
