<div class="container">
    <h1><b>Произведения Державина</b></h1>

    <h2 id="basnya-phonari">Басня “Фонари” 1796 или 1798 год</h2>

    <pre>
Случилось паре
Быть Фонарям в анбаре:
Кулибинскому и простому,
Такому,
Как ночью в мрачну тень
С собою носит чернь.
Кулибинский сказал: Как смеешь, старичишка,
Бумажный Фонаришка,
Ты местничать со мной?
Я барин, я начальник твой.
Ты видишь, на столбах ночною как порою
Я светлой полосою, –
В каретах, в улицах и в шлюпках на реке
Блистаю вдалеке.
Я весь дворец собою освещаю,
Как полная небес луна. –
Так подлинно, и я то знаю,
Ответствовал простой Фонарь:
Моя перед твоей ничто величина;
Сиянием вдали ты царь,
Лучами яркими ты барин;
Но только разве тем со мной неравен,
Что – вблизь и с стороны покажемся кому, –
Во мне увидят свет, в тебе увидят тму,
И ты окружных стекл лишь светишь лоскутками.
Иной и господин умен секретарями.
</pre>

    <h2 id="phonar">Стихотворение “Фонарь” Конец 1803 или начало 1804</h2>
<pre>
Гремит орган на стогне трубный,
Пронзает нощь и тишину;
Очаровательный огнь чудный
Малюет на стене луну.
В ней ходят тени разнородны:
Волшебник мудрый, чудотворный,
Жезла движеньем, уст, очес
То их творит, то истребляет;
Народ толпами поспешает
Смотреть к нему таких чудес.

Явись!
И бысть.
Пещеры обитатель дикий,
Из тьмы ужасной превеликий
Выходит лев.
Стоит, — по гриве лапой кудри
Златые чешет, вьет хвостом;
И рев
И взор его, как в мраке бури,
Как яры молнии, как гром,
Сверкая, по лесам грохочет.
Он рыщет, скачет, пищи хочет
И, меж древес
Озетя агницу смиренну,
Прыгнув, разверз уж челюсть гневну...
Исчезнь! Исчез.

Явись!
И бысть.
Средь гладких океана сткляных,
Зарею утренней румяных,
Спокойных недр
Голубо-сизый, солнцеокой
Усатый, тучный рыбий князь,
Осетр,
Из влаги появясь глубокой,
Пернатой лыстью вкруг струясь,
Сквозь водну дверь глядит, гуляет;
Но тут ужасный зверь всплывает
К нему из бездн,
Стремит в свои вод реки трубы
И, как серпы, занес уж зубы...
Исчезнь! Исчез.

Явись!
И бысть.
С долины мирныя, зелены
В полудни лебедь, вознесенный
Под облака,
Веселый глас свой ниспускает;
Его долина, роща, холм,
Река
Стократно эхом повторяет.
Но тут, как быстрый с свистом гром,
На рамена его сребристы
Орел прожорливый, кохтистый
Упал с небес.
Клюет, терзает, бьет крылами,
И пух летит, как снег полями...
Исчезнь! Исчез.

Явись!
И бысть.
Спустилось солнце, вечер темный
Открыл на небе миллионы
Горящих звезд.
Огнисты, легки метеоры
Слетают блещущим клубком
От мест
Превыспренних, — и в мраке взоры,
Как искры, веселят огнем;
Одна на дом тут упадает,
Раздута ветром, зажигает,
И в пламе город весь!
Столбом дым, жупел в воздух вьется,
Пожар, как рдяны волны, льется...
Исчезнь! Исчез.

Явись!
И бысть.
Торговый гость, смотря на счеты,
От жажды к злату и заботы
Хотя дрожит
Товарищей над барышами,
В паи деля товары их;
Но бдит
И ползает над чертежами
Всечасно странствиев морских.
В очках его всезряще око
Уж судно зрит в морях далеко
Сквозь сладких слез;
На нем вздут парус, флаг, дым, пламень,
Близ пристани подводный камень...
Исчезнь! Исчез.

Явись!
И бысть.
Оратай нив трудолюбивый,
Богобоязный, терпеливый,
Пролив свой пот,
Ходя под зноем за сохою
И туком угобзя бразды,
Ждет год
От брошенных его рукою
Семян собрать себе плоды.
Златым колосья соком полны,
Уже колеблются, как волны,
И тень небес
Его труд правый осеняет,
Но град из тучи упадает...
Исчезнь! Исчез.

Явись!
И бысть.
Чета младая новобрачных —
В златых, блистающих, безмрачных.
Цепях своих —
Любви в блаженстве утопает;
Преодолев препятства все,
Жених
От радости в восторге тает
И, в плен отдавшися красе,
Забыв на ложе прежни скуки,
В уста ее целует, в руки,
И средь завес
Коснулся уж забав рукою;
Но блещет смерть над ним косою...
Исчезнь! Исчез.

Явись!
И бысть.
Отважный, дерзкий вождь, счастливый,
Чрез свой пронырливый, кичливый
И твердый дух
Противны разметав знамены,
И на чело свое собрав
Вокруг
С народов многих лавр зеленый,
И царские права поправ,
В чаду властолюбивой страсти
У всей народной силы, власти
Взял перевес;
Граждан не внемлет добрых стону,
Простер десницу на корону...
Исчезнь! Исчез.

Не обавательный ль, волшебный,
Магический, сей мир, фонарь?
Где видны тени переменны,
Где, веселяся ими, царь,
Иль маг какой, волхв непостижный,
В своих намереньях обширный,
Планет круг тайно с высоты
Единым перстом обращает,
И земнородных призывает
Мечтами быть, иль зреть мечты!

Почто ж, о смертный дерзновенный,
Невежда средь своих наук!
Летая мыслями надменный,
Иль ползая в пыли, как жук,
Бежишь ты счастья за мечтами,
Толь преходящими пред нами,
Быв гостем, позванным на пир?
Не лучше ль блеском их не льститься;
Но зодчему тому дивиться,
Кто создал столь прекрасный мир?

Так будем, будем равнодушно
Мы зрительми его чудес;
Что рок велит, творить послушно,
Забавой быв других очес;
Пускай тот управляет нами,
Кто движет солнцами, звездами;
Он знает их и наш конец!
Велит — я возвышаюсь.
Речет — я понижаюсь.
Сей мир — мечты; их бог творец!

</pre>

<h2 id="oda-vitazu">Ода «Афинейскому витязю» 1796 год</h2>
    <pre>
Сидевша об руку царя
Чрез поприще на колеснице,
Державшего в своей деснице
С оливой гром, иль чрез моря
Протекшего в венце Нептуна,
Или с улыбкою Фортуна
Кому жемчужный нектар свой
Носила в чаше золотой —
Блажен, кто путь устлал цветами
И окурял алоем вкруг,
И лиры громкими струнами
Утешил, бранный славя дух.

Испытывал своих я сил
И пел могущих человеков;
А чтоб вдали грядущих веков
Ярчей их в мраке блеск светил
И я не осуждался б в лести,
Для прочности, к их громкой чести
Примешивал я правды глас ;
Звучал моей трубой Парнасс.
Но ах! познал, познал я смертных,
Что и великие из них
Не могут снесть лучей небесных:
Мрачит бог света очи их.

Так пусть Фортуны чада,
Возлегши на цветах,
Среди обилий сада,
Курений в облаках,
Наместо чиста злата,
Шумихи любят блеск;
Пусть лира торовата
Их умножает плеск:
Я руки умываю
И лести не коснусь;
Власть сильных почитаю, —
Богов в них чтить боюсь.

Я славить мужа днесь избрал,
Который сшел с театра славы,
Который удержал те нравы,
Какими древний век блистал;
Не горд — и жизнь ведет простую,
Не лжив — и истину святую,
Внимая, исполняет сам;
Почтен от всех не по чинам;
Честь, в службе снисканну, свободой
Не расточил, а приобрел;
Он взглядом, мужеством, породой,
Заслугой, силою — орел.

Снискать я от него
Не льщусь ни хвал, ни уваженья;
Из одного благодаренья,
По чувству сердца моего,
Я песнь ему пою простую,
Ту вспоминая быль святую,
В его как богатырски дни,
Лет несколько назад, в тени
Премудрой той жены небесной,
Которой бодрый дух младой
Садил в Афинах сад прелестной,
И век катился золотой, —

Как мысль моя, подобно
Пчеле, полна отрад,
Шумливо, но не злобно
Облетывала сад
Предметов ей любезных
И, взяв с них сок и цвет,
Искусством струн священных
Преобращала в мед:
Текли восторгов реки
Из чувств души моей;
Все были человеки
В стране счастливы сей.

На бурном видел я коне
В ристаньи моего героя;
С ним брат его, вся Троя,
Полк витязей явились мне!
Их брони, шлемы позлащенны,
Как лесом, перьем осененны,
Мне тмили взор; а с копий их, с мечей,
Сквозь пыль сверкал пожар лучей;
Прекрасных вслед Пентезилее
Строй дев их украшали чин;
Венцы Ахилла мой бодрее
Низал на дротик исполин.

Я зрел, как жилистой рукой
Он шесть коней на ипподроме
Вмиг осаждал в бегу; как в громе
Он, колесницы с гор бедрой
Своей препнув склоненье,
Минерву удержал в паденье;
Я зрел, как в дыме пред полком
Он, в ранах светел, бодр лицом,
В единоборстве хитр, проворен,
На огнескачущих волнах
Был в мрачной буре тих, спокоен,
Горела молния в очах.

Его покой — движенье,
Игра — борьба и бег,
Забавы — пляска, пенье
И сельских тьма утех
Для укрепленья тела.
Его был дом — друзей,
Кто приходил для дела, —
Не запирал дверей;
Души и сердца пища
Его — несчастным щит;
Не пышныя жилища:
В них он был знаменит.

Я зрел в Ареопаге сонм
Богатырей, ему подобных,
Седых, правдивых, благородных,
Весы державших, пальму, гром.
Они, восседши за зерцалом,
В великом деле или малом,
Не зря на власть, богатств покров,
Произрекали суд богов;
А где рукою руку мыли,
Желая сильному помочь, —
Дьяки, взяв шапку, выходили
С поклоном от неправды прочь.

Тогда не прихоть чли, — закон;
Лишь благу общему радели;
Той подлой мысли не имели,
Чтоб только свой набить мамон .
Венцы стяжали, звуки славы,
А деньги берегли и нравы,
И всякую свою ступень
Не оценяли всякий день;
Хоть был и недруг кто друг другу, —
Усердие вело, не месть:
Умели чтить в врагах заслугу
И отдавать достойным честь.

Тогда по счетам знали,
Что десять и что ноль;
Пиявиц унимали,
На них посыпав соль;
В день ясный не сердились,
Зря на небе пятно;
С ладьи лишь торопились
Снять вздуто полотно;
Кубарить не любили
Дел со дня на другой;
Что можно, вмиг творили,
Оставя свой покой.

Тогда Кулибинский фонарь,
Что светел издали, близ темен,
Был не во всех местах потребен;
Горел кристал, горел от зарь;
Стоял в столпах гранит средь дома:
Опрись на них, и — не солома.
В спартанской коже Персов дух
Не обаял сердца и слух;
Не по опушке добродетель,
Не по ходулям великан:
Так мой герой был благодетель
Не по улыбке, — по делам.

О ты, что правишь небесами,
И манием колеблешь мир,
Подъемлешь скиптр на злых с громами,
А добрым припасаешь пир,
Юпитер! О Нептун, что бурным,
Как скатертям, морям лазурным
Разлиться по земле велел;
Брега поставив им в предел!
И ты, Вулкан, что пред горнами
В дне ада молнию куешь!
И ты, о, Феб, что нам стрелами
Златыми свет и жизнь лиешь!

Внемлите все молитву,
О боги! вы мою:
Зверей, рыб, птиц ловитву
И благодать свою
На нивы там пошлите,
Где отставной герой
Мой будет жить. — Продлите
Век, здравье и покой
Ему вы безмятежной.
И ты, о милый Вакх!
Под час у нимфы нежной
Позволь спать на грудях.
    </pre>
</div>


<style>
    .container {
        margin: 0;
        padding: 0;

        justify-content: center;
        align-items: center;
        height: 100vh;

        padding: 20px;
        width: 100%;
    }

    h1 {
        font-size: 44px;
        color: #000957;
        text-align: center;
        line-height: 1.1;
        margin-bottom: 25px;
    }

    h2 {
        font-size: 36px;
        color: #000957;
        text-align: center;
        line-height: 1.1;
        margin-bottom: 20px;
    }

    pre {
        font-family: Inter;
    }
</style>
