<script>
    import { base } from '$app/paths';
    import Slider from '$lib/components/Slider.svelte';
    
    const slides = [
  {
    title: "Джеймс Кокс (1723 – 1800), Англия",
    text: "<p>Часы «Павлин» — часовой автомат, купленный у английского мастера Джеймса Кокса в XVIII веке и подаренный Екатерине II. Во время транспортировки механизм был поврежден: некоторые детали оказались сломаны, некоторые потерялись. Восстановление поручили Кулибину, который смог вернуть этот механизм в исходное состояние. Часы, украшенные золотом, серебром и драгоценными камнями, имеют в своей конструкции фигуры совы, петуха и павлина, которые способны двигаться, поворачивать голову и даже «петь». Сегодня этот шедевр хранится в Эрмитаже в Санкт-Петербурге и считается одним из символов музея.</p>"
},
  {
    title: "Жан Франсуа Бэкар, Франция",
    text: "<p>В Государственном Эрмитаже хранится уникальный шедевр французского ювелирного искусства — золотой футляр в форме яйца с часами и несессером, созданный парижским мастером Жаном Франсуа Бэкаром в 1757–1758 годах. Вероятно, этот предмет был подарен императрице Елизавете Петровне французским послом маркизом Жаком-Иоахимом Тротти де ла Шетарди в качестве пасхального подарка, что объясняет его форму. Несессер предназначен для хранения флакона с духами, ножниц и пилочки. Верхняя крышка украшена вензелем ЕI и надписью: «Tout. Les. Moments. Vous. Sont...one's» («Все моменты … для вас»), а под ней расположены часы с римскими цифрами. Нижняя крышка, скрывающая предметы первой необходимости, декорирована изображением российского двуглавого орла с московским гербом и знаком ордена Святого апостола Андрея Первозванного."
  }];
</script>
<main class="main-content">
    <h2>Часы <br /> «яичной фигуры»</h2>

    <Slider {slides} />

    <div class="info-text">
        <p>
            Часы «яичной фигуры» — изобретение Ивана Кулибина, созданное специально для императрицы Екатерины II.
            Мастер работал над этим уникальным механизмом почти три года — с 18 октября 1764 года по 12 июня 1767 года.
        </p>
        <p>
            Уже на этапе проектирования стало ясно, что работа потребует значительных финансовых вложений.
            Спонсором выступил купец М.А.Костромин, согласившийся финансировать проект при условии,
            что подарок будет преподнесен императрице от их общего имени.
        </p>
        <p>
            Основную часть работы Кулибин выполнял самостоятельно, привлекая наемных мастеров лишь для резьбы по корпусу,
            золочения, серебрения, пайки и других вспомогательных задач. Механизм, состоявший из 427 деталей,
            стал настоящим чудом инженерной мысли. Одной из его особенностей стало расположение циферблата внизу корпуса.
            Чтобы Екатерина II могла легко видеть показания стрелок, Кулибин создал изящную подставку с системой зеркал,
            позволяющую считывать время без переворачивания часов.
        </p>
        <p>
            Каждый час створки корпуса, выполненного в форме яйца, открывались, показывая миниатюрную сцену с Гробом Господним.
            У заваленного камнем входа стояли фигурки стражников. Когда камень откатывался, появлялся ангел,
            и стражники в почтении падали ниц. Через полминуты к ангелу подходили жёны–мироносицы,
            а в этот момент раздавался звон колоколов и трижды исполнялся церковный стих «Христос воскресе».
            После завершения мелодии створки плавно закрывались.
        </p>
        <p>
            Во второй половине дня ежечасно проигрывалась другая мелодия — «Воскрес Иисус из гроба».
            Кроме того, в полдень механизм исполнял музыкальную композицию, сочинённую Кулибиным в честь визита
            Екатерины II в Нижний Новгород.
        </p>
        <p>
            Часы были сконструированы таким образом, что позволяли прослушать любую из трёх музыкальных пьес в любое время.
            Это стало возможным благодаря внутреннему разделению на три отдельных специальных механизма и трём независимым заводам:
            часовому, боевому и курантовому.
        </p>
        <p>
            На протяжении 30 лет, пока за часами ухаживал сам Иван Кулибин, они работали без сбоев.
            Однако после передачи механизма И.Ф.Буссе часы вышли из строя. Ремонт занял три года —
            сложность заключалась в чрезвычайно мелких деталях, а зрение Кулибина ухудшилось.
            После завершения ремонта мастер составил подробную инструкцию по уходу за часами,
            чтобы сохранить их уникальный механизм.
        </p>
        <p>
            Сегодня эти часы можно увидеть в коллекции Государственного Эрмитажа.
        </p>
    </div>
    <img src="{base}/images/a/egg-shaped-watch.jpg" alt="Часы яичной фигуры" class="drawing" />
</main>

<style>
    .main-content {
        margin: 0 auto;
        color: #000000;
        padding: 20px;
    }
    .drawing {
        position: relative;
        width: 600px;
        height: 400px;
        overflow: hidden;
        margin: 0 auto 30px auto;
        object-fit: contain;
    }
    .info-text {
        font-size: 20px;
        max-width: 800px;
        line-height: 1.4;
        text-align: left;
        margin: 0 auto;
        padding: 0 20px;
    }
    h2 {
        font-size: 54px;
        font-weight: bold;
        margin-bottom: 30px;
        color: #000957;
        line-height: 1;
        text-align: center;
    }
    p {
        padding-bottom: 20px;
    }
    @media (max-width: 700px) {
        .drawing {
            width: 100%;
            height: auto;
        }
    }
    @media (max-width: 500px) {
        h2 {
            font-size: 38px;
        }
        .info-text {
            font-size: 18px;
        }
    }
    @media (max-width: 380px) {
        h2 {
            font-size: 28px;
        }
    }

</style>
