<script>
    import EmbeddedBlock from '$lib/components/EmbeddedBlock.svelte';
    import EmbeddedBlockText from '$lib/components/EmbeddedBlockText.svelte';
    import { base } from '$app/paths';
    import Slider from '$lib/components/Slider.svelte';
    
    const slides = [
  {
    title: "Леонардо да Винчи (1452 – 1519), Италия",
    text: "<p>Леонардо да Винчи не нуждается в представлении. Итальянский художник, учёный, изобретатель, писатель является одним из ключевых представителей эпохи Возрождения. Помимо шедевров искусства, да Винчи знаменит своими многочисленными изобретениями, многие из которых так и остались нереализованными.</p><p>Согласно письму Леонардо к турецкому султану Баязиду II (1502–1503 года) Леонардо предлагал ему проект моста, соединяющего Галату и Стамбул через бухту Золотой Рог.</p><p>По описанию Леонардо, мост должен был выглядеть как очень пологая арка длиною 600 локтей (350,16 м), где 400 локтей над морем и 200 на суше (233,44 и 116,72 м соответственно), шириной 40 локтей (23,75 м), высотой от воды 70 локтей (40,852 м). Её концы жёстко закреплялись посредством «ласточкиных гнёзд» — конструкции, которую да Винчи разработал за несколько лет до работы над мостом.</p><p>Этот проект так и не был реализован, потому что такие масштабы были немыслимыми в то время. Только в 1836 году здесь был возведен первый мост.</p><p>Да Винчи также занимался разработкой конструкций разборных и поворотных мостов. Первые из них представляли собой систему связанных между собой стволов деревьев в определённой последовательности:</p><p>В собранном состоянии поворотный мост ставился параллельно реке. Для перехода на другой берег его вращали с помощью канатов и лебёдки вокруг его опоры. При вращении на лебёдку наматывался канат, соединённый с мостом через блок. Внизу, под конструкцией, на коротком «плече» располагалась клеть, набитая камнями для противовеса при балансировке и вращении. Такой мост был очень прост в управлении:</p>",
    images:["/images/additional/Bridge_1.png", "/images/additional/Bridge_2.png"]
},
  {
    title: "Итиэль Таун (1784 – 1844), США",
    text: "<p>До первой половины XIX века многие мосты строились в виде конструкций, состоящих из балок. Вот пример такой конструкции: сплошная высокая балка большого пролёта, в которой два слоя плотно прилегающих друг к другу перекрёстных досок образовывали стенку, а пояса изготовляли из брусьев со стыковкой врубками.</p><p>Американский инженер Итиэль Таун предложил в 1829 году раздвинуть доски в такой конструкции, тем самым он изобрёл систему решётчатых ферм. Затем в 1840 году американский архитектор Вильям Гау (1803–1852) запатентовал свою систему ферм, в которой заменил деревянные элементы, работающие на растяжение, на чугун.</p><p>Проект моста через р. Мшагу с деревянными фермами системы Гау (1847–1848 года):</p><p>Удивительно, что Кулибин изобрёл систему ферм в собственном проекте моста через Неву в 1770–х годах, более чем за 50 лет до Тауна и других инженеров! К сожалению, проект не был реализован.</p><p>Далее система была усовершенствована русским инженером Дмитрием Ивановичем Журавским (1821–1891) и получила название фермы Гау - Журавского. Д. И. Журавский доказал, что ближе к опорам возникают большие усилия в элементах решётки, и предложил для решения этой проблемы изготовлять элементы фермы разной толщины. Это напоминает работу Кулибина, который при работе над третьей моделью своего моста изготовлял элементы моста с сечением разного размера к середине и к концам для упрочнения конструкции.</p>",
    images: ["/images/additional/Bridge_3.png"]
  },
  {
    title: "Александр Гюстав Эйфель (1832–1923), Франция",
    text: "<p>Гюстав Эйфель — французский инженер, который видел в арочных металлических мостах не только конструкции, но и произведения искусства. Он построил шесть мостов во Франции, Португалии и Вьетнаме. Мост Понте–де–Дона–Мария–Пиа через реку Дору (1877) в Португалии с пролётом в 160 м был первым из этих конструкций. Он возвышается на 60 м над рекой. На протяжении семи лет этот мост являлся самым длинным в мире по длине пролёта.</p><p>В 1991 году мост получил статус национального памятника.</p><p>Ещё одним мостом, получившим этот статус, является железнодорожный мост Виадук Гараби через реку Трюйер во Франции: длина — 564,6 м, главный арочный пролёт — 180 м, высота арки — 60 м.</p><p>Мост Кулибина мог стать самым длинным арочным мостом своего времени — длина пролета составляла почти 300 метров. Эйфель конструировал свои мосты через 100 лет, технологии того времени позволяли использовать более надёжные материалы, а также более продвинутые методы постройки.</p><p>Тем не менее спустя целый век инженер достиг рекордной длины арочного пролёта — 160-180 м, что почти в 2 раза меньше, чем длина моста Кулибина. Это сравнение дает наглядное представление о том, насколько кулибинский проект был инновационным и опередившим своё время.</p>",
    images: ["/images/additional/Bridge_4.png", "/images/additional/Bridge_5.png"]
}
];
</script>


<div class="content_container">
    <div class="main_image">
        <img class="top_image" alt="Мост Кулибина" src="{base}/images/a/bridge.jpg">
    </div>
    <ul>
        <li class="slider_name">
            <p>Сравнение с другими изобретениями</p>
        </li>
    </ul>

    <Slider {slides} />

    <ul>
        <li class="part_name">
            <p>Одноарочный мост</p>
        </li>
        <li class="part_text">
            <p>
                Иван Кулибин, известный своими изобретениями и инженерными решениями, не раз обращал внимание на проблемы, с которыми сталкивались жители Санкт–Петербурга.
                <br><br>
                Одной из таких проблем была сложность сообщения между берегами Невы, ширина которой достигает примерно 300 метров. Единственным мостом, соединявшим Адмиралтейскую сторону с Васильевским островом, был наплавной Исаакиевский мост, построенный на плашкоутах. Однако он был крайне неудобен: его приходилось разбирать перед ледоставом и снова наводить после того, как лёд сходил.
                <br><br>
                С самого приезда в Санкт–Петербург Ивана Кулибина захватила идея создания постоянного и надёжного моста через Неву, который бы не препятствовал судоходству. В 70-х годах XVIII века изобретатель приступил к работе над этим проектом. Его замысел заключался в создании однопролётного арочного моста, поскольку установка промежуточных опор в глубокой и быстрой Неве представлялась крайне сложной задачей. Конструкция должна была опираться своими концами прямо на берега реки, а основным материалом для строительства Кулибин выбрал дерево.
                <br><br>
                Уже в 1771 году была готова первая модель. Она успешно прошла все испытания, но Кулибин остался недоволен результатом.
                <br><br>
                Особого внимания заслуживает тот факт, что все расчёты изобретатель проводил самостоятельно, применяя методы, которые актуальны и по сей день. Например, он доказал, что надёжность моста можно проверить, испытывая его уменьшенную модель. Более того, опытным путём Кулибин вывел закон взаимодействия сил в арке моста задолго до его теоретического обоснования.
                <br><br>
                Как же выглядела конструкция? Кулибин изобрёл совершенно новую технику —  применение решётчатых ферм — перекрестно скрепленных деревянных стержней.
                <br><br>
                В конце 1772 года Кулибин завершил работу над второй моделью, но вновь остался недоволен, а спустя три года, благодаря заинтересованности князя Потёмкина, по императорскому приказу ему была выделена тысяча рублей на создание третьей модели. К концу 1776 года она была готова.
            </p>
        </li>
        <li>
            <EmbeddedBlock title="Любопытный факт">
                <EmbeddedBlockText slot="full">
                    В 1772 году Лондонская академия назначила большую премию тому, кто сделает лучшую модель одноарочного моста, без свай, концы которого упирались бы только на берегах реки. Модель Кулибина полностью соответствовала требованиям, однако он отказался посылать проект в Англию, ведь очень хотел построить мост именно в России, на Неве, а не на Темзе.
                </EmbeddedBlockText>
            </EmbeddedBlock>

        </li>
        <li class="part_text">
            <p>
                Третья модель была длиной в 14 саженей (почти 30 метров) и была построена в масштабе 1:10 по отношению к реальному мосту. Усовершенствование модели заключалось в изменении в распределении массы. Средняя часть сооружения весила меньше по сравнению с боковыми, и к его середине сечение всех элементов было меньшего размера, а к концам — большего. За счет этого устойчивость конструкции увеличивалась. Этот метод до сих пор используется при строительстве арочных мостов.
                <br><br>
                Ещё одним изменением в этой модели стало увеличение числа решётчатых ферм, скреплённых теперь мощными поясами из брусьев. Деревянные части соединялись железными болтами с шайбами. Всё это укрепляло мост и повышало устойчивость к толчкам и ветру.
                <br><br>
                Согласно плану, мост должен был достигать в длину примерно 300 метров, а в высоту — 30 метров. Кулибин даже предусмотрел, чтобы подъём и спуск не были крутыми: подъём должен был начинаться примерно за 200 метров от моста, а проезд проходил почти по прямой (у концов моста на уровне верха арки, а к середине — на уровне её низа). Планировались также пешеходные дорожки и архитектурные украшения моста.
                <br><br>
                Иван Петрович детально продумал план постройки моста: он собирался строить его зимой, исследовал для этого прочность невского льда, составил план возведения и установки опор, сборки отдельных частей. Леонард Эйлер, проверявший расчеты Кулибина, был поражён их абсолютной точностью.
                <br><br>
                Седьмого января 1777 года (27 декабря 1776 года по старому стилю) модель была испытана перед комиссией академиков.
                <br><br>
                Несмотря на насмешки академиков, модель Кулибина смогла выдержать 3870 пудов (больше 63 тонн), а затем самого Кулибина и всех академиков, поднявшихся на неё. Далее, около месяца модель находилась под нагрузкой и полностью выдержала испытание.
                <br><br>
                К сожалению, вопреки ошеломительному успеху, мост построен не был. Кулибин лишь получил ещё 2 тысячи за модель (более пятисот рублей не были возмещены), а сама модель впоследствии была перевезена в Таврический сад, где, вероятно, разрушилась от времени.
            </p>
        </li>

    </ul>


</div>


<style>
    :root {
        --top-image-margin: 50%;
    }
    li {
        padding-top: 10px;
    }
    .slider_name p {
        font-weight: 700;
        font-size: 26pt;
        line-height: 120%;
        text-align: center;
        color: #000957;
    }
    .part_name p {
        font-weight: 700;
        font-size: 32pt;
        line-height: 120%;
        text-align: center;
        color: #000957;
    }
    .part_text p {
        line-height: 140%;
        letter-spacing: 0%;
    }

    .content_container {
        justify-content: center;
        height: 100%;
        background-color: #fff4f4;
        padding: 0 20px;
        overflow: hidden;
    }

    .main_image {
        width: 100%;
        height: auto;
        padding-top: 20px;
        margin: 0;
    }

    .top_image {
        width: 551px;
        margin: 0 auto;
    }
    @media (max-width: 551px) {
        .content_container {
            padding: 0 20px;
        }

        .top_image {
            width: calc(100% + var(--top-image-margin));
            max-width: none;
            margin: 0 calc(-1*(var(--top-image-margin)/2));
        }
    }

    @media (max-width: 320px) {
        .part_name p {
            font-size: 28px;
        }
    }

</style>
