
<script>

    import main_image from '$lib/images/bridge.jpg'

    import EmbeddedBlock from '$lib/components/EmbeddedBlock.svelte';
    import EmbeddedBlockText from '$lib/components/EmbeddedBlockText.svelte';

</script>
<link href="https://fonts.googleapis.com/css2?family=Inter:wght@400;700&display=swap" rel="stylesheet">


<div class="content_container">
    <div class="main_image">
        <img class="top_image" alt="Мост Кулибина" src={main_image}>
    </div>
    <ul>
        <li class="part_name">
            <p>Одноарочный мост</p>
        </li>
        <li class="part_text">
            <p>Иван Кулибин, известный своими изобретениями и инженерными решениями, не раз обращал внимание на проблемы, с которыми сталкивались жители Санкт-Петербурга.
                <br><br>
                Одной из таких проблем была сложность сообщения между берегами Невы, ширина которой достигает примерно 300 метров. Единственным мостом, соединявшим Адмиралтейскую сторону с Васильевским островом был наплавной Исаакиевский мост, построенный на барках. Однако он был крайне неудобен: его приходилось разбирать перед ледоставом и снова наводить после того, как лёд сходил.
                <br><br>
                С самого приезда в Санкт-Петербург Ивана Кулибина захватила идея создания постоянного и надёжного моста через Неву, который бы не препятствовал судоходству. В 70-х годах XVIII века изобретатель приступил к работе над этим проектом. Его замысел заключался в создании однопролётного арочного моста, поскольку установка промежуточных опор в глубокой и быстрой Неве представлялась крайне сложной задачей. Конструкция должна была опираться своими концами прямо на берега реки, а основным материалом для строительства Кулибин выбрал дерево.
                <br><br>
                Уже в 1771 году была готова первая модель. Она успешно прошла все испытания, но Кулибин, известный своим стремлением к совершенству, остался недоволен результатом. 
                <br><br>
                Особого внимания заслуживает тот факт, что все расчёты изобретатель проводил самостоятельно, применяя методы, которые актуальны и по сей день. Например, он доказал, что надёжность моста можно проверить, испытывая его уменьшенную модель. Более того, опытным путём Кулибин вывел закон взаимодействия сил в арке моста, который был теоретически обоснован лишь спустя 50 лет — в 1823 году.
                <br><br>
                Как же выглядела конструкция? Кулибин изобрёл совершенно новую технику – применение решётчатых ферм. Ферма – стержневая несущая конструкция в строительной механике. Кулибинская система ферм заключалась в том, что мост строился из перекрёстно скрепленных деревянных стержней.
                <br><br>
                В конце 1772 года Кулибин завершил построение второй модели, но снова был недоволен, а спустя три года, благодаря заинтересованному князю Потёмкину, по императорскому приказу ему была выделена тысяча рублей на создание третьей модели. К концу 1776 года она была готова.
            </p>
        </li>
        <li>
            <!-- EmbeddedBlock'у нужно поменять style -->
            <EmbeddedBlock title="Любопытный факт">
                <EmbeddedBlockText slot="short">
                    В 1772 году Лондонская академия назначила большую премию тому, кто ...
                </EmbeddedBlockText>
                <EmbeddedBlockText slot="full">
                    В 1772 году Лондонская академия назначила большую премию тому, кто сделает лучшую модель одноарочного моста, без свай, концы которого упирались бы только на берегах реки. Модель Кулибина полностью соответствовала требованиям, однако он отказался посылать проект в Англию, ведь очень хотел построить мост именно в России, на Неве, а не на Темзе.
                </EmbeddedBlockText>
            </EmbeddedBlock>

        </li>
        <li class="part_text">
            <p>
                Третья модель была длиной в 14 саженей (почти 30 метров) – она была построена в масштабе 1:10 по отношению к реальному мосту. Главное улучшение данной модели – в середине она была легче, а к концам – тяжелее. Достиг этого Кулибин тем, что к середине конструкции сечение всех элементов было меньшего размера, а к концам – большего. Устойчивость увеличивалась, и этот метод до сих пор используется при строительстве арочных мостов. Ещё одним изменением в этой модели стало увеличение числа решётчатых ферм, скреплённых теперь мощными поясами из брусьев. Деревянные части соединялись железными болтами с шайбами. Всё это укрепляло мост и повышало устойчивость к толчкам и ветру.
                <br><br>
                Согласно плану мост должен был достигать в длину примерно 300 метров, а в высоту – 30 метров. Кулибин даже предусмотрел, чтобы подъём и спуск не были крутыми – подъём должен был начинаться примерно за 200 метров от моста, а проезд проходил почти по прямой (у концов моста на уровне верха арки, а к середине – на уровне её низа). Планировались также пешеходные дорожки и архитектурные украшения моста.
                <br><br>
                Кулибин, помимо того, что всегда крайне скрупулёзно подходил к своим изобретениям, также продумывал всевозможные вероятности неисправностей. Иван Петрович детально продумал план постройки моста – он собирался строить его зимой, исследовал для этого прочность невского льда, распланировал все методы установки опор, сборки отдельных частей. Позже все его расчёты проверил сам математик Эйлер, который был поражён их абсолютной точностью. 7 января 1777 года (27 декабря 1776 года по старому стилю) модель была испытана перед комиссией академиков.
                <br><br>
                Несмотря на насмешки академиков, модель Кулибина смогла выдержать 3870 пудов (больше 63 тонн), а затем самого Кулибина и всех академиков, поднявшихся на неё. Далее около месяца модель находилась под нагрузкой и полностью выдержала испытание.
                <br><br>
                К сожалению, вопреки ошеломительному успеху, мост построен не был. Кулибин лишь получил ещё 2 тысячи за модель (более пятисот рублей всё же возмещены не были), золотую медаль «за успехи в механике», а сама модель впоследствии была перевезена в Таврический сад, где, вероятно, разрушилась от времени.
            </p>
        </li>

    </ul>
    

</div>


<style>
    :root {
        --top-image-margin: 50%;
    }
    li {
        padding-top: 10px;
    }
    .part_name p {
        font-family: 'Montserrat', sans-serif;
        font-weight: 700;
        font-size: 34pt;
        line-height: 120%;
        letter-spacing: -2%;
        text-align: center;
        color: #000957;
    }
    .part_text p {
        font-family: Inter;
        line-height: 140%;
        letter-spacing: 0%;
    }

    .content_container {
        justify-content: center;
        height: 100%;
        background-color: #fff4f4;
        padding: 0 20px; 
        overflow: hidden;
    }

    .main_image {
        width: 100%;
        height: auto;
        padding-top: 20px;
        margin: 0;
    }

    .top_image {
        width: 551px;
        margin: 0 auto;
    }
    @media (max-width: 551px) {
        .content_container {
            padding: 0 20px;
        }
        
        .top_image {
            width: calc(100% + var(--top-image-margin));
            max-width: none;
            margin: 0 calc(-1*(var(--top-image-margin)/2));
        }
        
    }


</style>