<script>
    import { base } from '$app/paths';
    import Slider from '$lib/components/Slider.svelte';
    
    const slides = [
  {
    title: "Роберт Фултон(1765–1815), США",
    text: '<p>В 1807 году в Америке Роберт Фултон создал пароход. С помощью американского посла Джона Куинси Адамса изобретатель хотел получить права на пароходостроение в России. Адамс не поддерживал эту идею, так как сомневался в способности российских предпринимателей управляться с подобными судами.</p><p>Несмотря на, это Фултон получил привилегию на постройку пароходов на 15 лет. Взамен изобретатель обязывался предоставить описание и чертежи, но так и не выполнил данное условие.</p>'
},
  {
    title: "Чарльз Берд (1766–1843), Российская империя",
    text: '<p>Чарльз Берд — шотландский мастер, который большую часть своей жизни прожил в России. В 1792 году он начал здесь собственное дело, открыв литейный завод с самыми передовыми технологиями производства того времени. В качестве основного двигателя на заводе была использована паровая машина, которая и стала основой первого парового судна в России.</p><p>В 1815 году в Санкт-Петербурге Чарльз Бёрд построил экспериментальный паровой корабль, для корпуса которого использовали небольшое речное судно — сойминку. Третьего ноября этого же года он совершил свой первый рейс из Санкт-Петербурга в Кронштадт.</p><p>В 1816 году было построено второе пароходное судно, а затем ещё несколько для сообщения между Петербургом и Кронштадтом. Данные суда также использовались на Неве и других реках.</p>'
  }
];
</script>
<main class="main-content">

<img src="{base}/images/a/boat.jpg" alt="Водоходное судно" class="drawing" />

<Slider {slides} />

<h2>Водоходное судно</h2>
<div class = "info-text">
    <p>
    В 1781 году правительство Екатерины II объявило конкурс на улучшение конструкции судов, стремясь сделать речной транспорт более эффективным.  Кулибин включился в работу. Он разрабатывал инновационные механизмы, тщательно тестировал их на водах Невы, стремясь найти наиболее эффективное решение. Результатом напряженного труда изобретателя стало водоходное судно, в котором силу бурлаков заменила сила течения реки.
    </p>
    <p>
        Механизм работал по принципу бурлацкой тяги, подачами. Якорь с канатом завозился на судно. Один конец каната прикреплялся к конусным барабанам, которые приводились в действие с помощью передач от вала бортовых вододействующих колес. Колесо Кулибина состояло из двух ободов, радиальные спицы которых образовывали восемь стержней, на каждый из которых навешивали по три лопасти. Первоначально планировалось установить четыре таких колеса, но в итоге таких колес на судне было поставлено два, для облегчения веса. Они двигались силой течения против его направления.
    </p>
    <p>
        8 ноября 1782 года водоходное судно было проверено на Неве и Кулибину выплатили вознаграждение 5000 рублей. Начать постройку такого судна на Волге изобретателю удалось лишь осенью 1801 года при Александре I с условием, что весь материальный риск Иван Кулибин возьмёт на себя. Изобретатель усовершенствовал судно, добавив поворотные лопасти к колесам.
    </p>
    <p>
    В 1804 году водоходное судно с грузоподъемностью 8500 пудов было опробовано. Скорость судна не уступала судну, которое приводилось в движение бурлацкой силой.
    </p>


    <img src="{base}/images/a/boat-1.jpg" alt="Водоходное судно" class="drawing" />
    <img src="{base}/images/a/boat-2.png" alt="Водоходное судно" class="drawing" />
    <img src="{base}/images/a/boat-3.jpg" alt="Водоходное судно" class="drawing" />
</div>
</main>

<style>
    .main-content {
        margin: 0 auto;
        text-align: center;
        background: #FFF2F2;

    }
    .drawing {
        position: relative;
        width: 600px;
        height: 400px;
        overflow: hidden;
        margin: 0 auto 30px auto;
    }
    .info-text {
        font-size: 20px;
        max-width: 100%;
        line-height: 1.4;
        text-align: left;
        margin-left: 20px;
        margin-right: 20px;

    }

    h2 {
        font-size: 68px;
        font-weight: bold;
        margin-bottom: 30px;
        color: #000957;
        line-height: 1;
    }
    p{
        padding-bottom: 20px;
    }

    @media (max-width: 700px) {

        .drawing {
            width: 100%;
            height: auto;
        }
    }
    @media (max-width: 500px) {

        h2 {
            font-size: 38px;
        }
    }
</style>
