<script>
    import EmbeddedBlock from '$lib/components/EmbeddedBlock.svelte';
    import EmbeddedBlockText from '$lib/components/EmbeddedBlockText.svelte';
</script>

<div class="container">
    <h1 class="title">Стихотворения Кулибина</h1>
    <div class="wrapper">
        <EmbeddedBlock>
            <EmbeddedBlockText slot="short"><p class="poem-text">“...Мешает правильному ходу
                То, что употребив свободу,
                Стремится слабый человек
                Замедлить мира плавный бег...”.
                
                И. П. Кулибин “В ознаменование Светлого Господнего воскресения 1764 г”</p>
            </EmbeddedBlockText>
        </EmbeddedBlock>
    </div>
    <p>Вплоть до XIX века, особенно в эпоху Просвещения, наука и искусство не были строго разделены. Учёные часто занимались не только естественными науками, но и философией, литературой и поэзией. Это было связано с идеалом «универсального человека» (homo universalis) — личности, всесторонне развитой и добившейся успехов в различных областях. Таких людей называли энциклопедистами, полиматами или полисторами.</p>
    <p>К числу выдающихся полиматов XVIII века можно отнести многих деятелей. Например, Василия Никитича Татищева — инженера-артиллериста, экономиста, географа, а также автора первого капитального труда по истории России. Или Андрея Тимофеевича Болотова — русского писателя, ботаника и лесовода, ставшего одним из основателей агрономии в России. Безусловно, возглавляет этот список Михаил Васильевич Ломоносов.</p>
    <p>Неудивительно, что, по свидетельствам биографов, именно Ломоносов стал детским кумиром Ивана Петровича Кулибина. Сын простого рыбака, достигший звания академика, Ломоносов не только писал научные труды, но и создавал прекрасные (по канонам того времени) литературные произведения, которые глубоко впечатлили будущего изобретателя.</p>
    <p>К большому недовольству отца, юный Кулибин заучивал эти стихотворения наизусть и распевал их, аккомпанимируя себе на гуслях. А спустя некоторое время, подражая, начал складывать стихи и сам.</p>
    <p>В одной из ранних своих работ, он так жалуется на свою судьбу:</p>
    <div class="wrapper">
    <EmbeddedBlock>
        <EmbeddedBlockText slot="short">Ах, о радости я беспрестанно вздыхаю,
            Радости же я совсем не знаю.
            И к любви я стремлюсь душою,
            Ах, кому же я печаль свою открою.
        </EmbeddedBlockText>
    </EmbeddedBlock>
    </div>
    <p>На протяжении всего XVIII века поэтический классицизм претерпевал значительные изменения и был предметом оживлённых дискуссий среди образованного общества.
    <br>Эстетические идеи того времени предполагали строгое разделение поэтических жанров на «низкие», «средние» и «высокие», причём последние, включавшие в себя жанр оды, ценились среди высшего сословия больше всего.</p>
    <p>Обычно оды посвящались государству, значимым событиям или выдающимся личностям и часто содержали библейские и античные мотивы. Характерной чертой поэзии Кулибина стало добавление к этим традиционным темам ещё одной — значимости знания. Не менее важным для него был и вопрос веры. В результате в его произведениях строки, посвященные духовному восприятию мира, нередко соседствуют с размышлениями о науке. В его творчестве чувствуется влияние идей просвещенного абсолютизма.</p>
    <p>Это особенно заметно в оде «В ознаменование Светлого Господнего Воскресения 1764 г.», одного из первых его крупных произведений. Центральная тема этого стихотворения — идеи божественного устройства Вселенной и неизбежности высшего порядка. Кулибин рассматривает мир как спроектированный механизм, где всё подчинено своим строгим законам:</p>
    <div class="wrapper">
        <EmbeddedBlock>
            <EmbeddedBlockText slot="short">…Вселенную Господь создал,
                Как часовщик часы собрал.
                Пружины там и шестерни
                Отмеривают наши дни...
            </EmbeddedBlockText>
        </EmbeddedBlock>
    </div>
    <p>Другой пример — стихотворение, написанное в 1767 году, когда Кулибин представлял Екатерине II свои часы “яичной фигуры". Изобретение он сопроводил строками собственного сочинения:</p>
    <div class="wrapper">
        <EmbeddedBlock>
            <EmbeddedBlockText slot="short">...Простру в том руки к щедрому богу,
                Что дал науки и милость многу,
                Сердце царицы его десницы
                Храним всегда.
                За преблагие твоя доброты,
                И все драгие ко всем щедроты,
                Свыше правитель и покровитель
                Твой зиждитель всех…
            </EmbeddedBlockText>
        </EmbeddedBlock>
    </div>
    <p>Ещё одно известное произведение Кулибина — ода графу Алексею Григорьевичу Орлову, написанная в 1771 году. Орлов, выдающийся военачальник и фаворит Екатерины II, прославился победой в Чесменском сражении 1770 года над турецким флотом. Эта битва стала символом мощи русского оружия и укрепила позиции России на международной арене. В оде Кулибин пишет:</p>
    <div class="wrapper">
        <EmbeddedBlock>
            <EmbeddedBlockText slot="short">...Пусть скотовод скотом, а хлебом — землепашец,
                Учёный человек — цветением наук,
                А воин — ратным подвигом докажут
                Любовь к стране родной. Греми же, трубный звук…
            </EmbeddedBlockText>
        </EmbeddedBlock>
    </div>
    <p>Важной особенностью стиля Кулибина является его простота и вольности в использовании языка, которые могут быть неочевидны современному читателю.</p>
    <p>В начале второй половины века, Ломоносов разделил все слова, которые употребляются в литературе на три категории: те, которые есть и в русском, и в церковнославянском и известны всем; церковнословянские, которые известны всем грамотным людям; и, наконец, слова, которых в церковнославянском языке нет.</p>
    <p>В высоком штиле позволялось употреблять слова только первого и второго рода, и эта литературная норма изменилась только при реформах Карамзина.
    <br>Поэзия Кулибина выпадает на период между этим культурным сдвигом. Он (скорее всего невольно) нарушает установленные правила и использует слова третьего рода, но старается придерживаться первых двух. Его поэзия лишена придворного лоска и тяжеловесности, но при этом не уходит в просторечные народные мотивы, которые их сменят.</p>    
    <p>В наше время его поэтические труды остаются малоизвестными, но они дополняют образ великого мастера, чьё имя стало нарицательным.</p>
</div>

<style>
    .wrapper {
        max-width: 329px;
        margin: 0 auto;
    }

    .poem-text {
        text-align: right;
    }

    .container {
        margin: 0;
        padding: 0;

        justify-content: center;
        align-items: center;
        height: 100vh;

        padding: 20px;
        max-width: 1000px;
        width: 100%;
    }

    h1 {
        font-size: 44px;
        color: #000957;
        text-align: center;
        line-height: 1.1;
        font-weight: bold;
        margin-bottom: 35px;
    }

    p {
        color: #000000;
        line-height: 1.6;
        margin-bottom: 15px;
    }

    @media screen and (max-width: 375px) {
        .title {
            font-size: 36px;
        }
    }
</style>
