<script>
    import EmbeddedBlock from '$lib/components/EmbeddedBlock.svelte';
    import EmbeddedBlockText from '$lib/components/EmbeddedBlockText.svelte';
</script>

<div class="container">
    <h1 class="title">Стихотворения Кулибина</h1>
    <div class="wrapper">
        <EmbeddedBlock>
            <EmbeddedBlockText slot="short"><p class="poem-text">“...Мешает правильному ходу
                То, что употребив свободу,
                Стремится слабый человек
                Замедлить мира плавный бег...”.

                И. П. Кулибин “В ознаменование Светлого Господнего воскресения 1764 г”</p>
            </EmbeddedBlockText>
        </EmbeddedBlock>
    </div>
    <p>Вплоть до XIX века, особенно в эпоху Просвещения, наука и искусство не были строго разделены. Учёные часто занимались не только естественными науками, но и философией, литературой и поэзией. Это было связано с идеалом «универсального человека» (homo universalis) — личности, всесторонне развитой и добившейся успехов в различных областях. Таких людей называли энциклопедистами, полиматами или полисторами.</p>
    <p>К числу выдающихся полиматов XVIII века можно отнести многих деятелей. Например, Василия Никитича Татищева — инженера-артиллериста, экономиста, географа, а также автора первого капитального труда по истории России. Или Андрея Тимофеевича Болотова — русского писателя, ботаника и лесовода, ставшего одним из основателей агрономии в России. Безусловно, возглавляет этот список Михаил Васильевич Ломоносов.</p>
    <p>Неудивительно, что, по свидетельствам биографов, именно Ломоносов стал детским кумиром Ивана Петровича Кулибина. Сын простого рыбака, достигший звания академика, Ломоносов не только писал научные труды, но и создавал прекрасные литературные произведения, которые глубоко впечатлили будущего изобретателя.</p>
    <p>К большому недовольству отца, юный Кулибин заучивал эти стихотворения наизусть и распевал их, аккомпанируя себе на гуслях. А спустя некоторое время, подражая, начал складывать стихи и сам.</p>
    <p>В одной из ранних своих работ, он так жалуется на свою судьбу:</p>
    <div class="wrapper">
    <EmbeddedBlock>
        <EmbeddedBlockText slot="short">Ах, о радости я беспрестанно вздыхаю,
            Радости же я совсем не знаю.
            И к любви я стремлюсь душою,
            Ах, кому же я печаль свою открою.
        </EmbeddedBlockText>
    </EmbeddedBlock>
    </div>
    <p>На протяжении всего XVIII века жанр поэзии претерпевал значительные изменения и был предметом оживлённых дискуссий среди образованного общества.
    <br>Эстетические идеи того времени предполагали строгое разделение поэтических жанров на «низкие», «средние» и «высокие», причём последние, включавшие в себя жанр оды, ценились среди высшего сословия больше всего.</p>
    <p>Обычно оды посвящались государству, значимым событиям или выдающимся личностям и часто содержали библейские и античные мотивы. Характерной чертой поэзии Кулибина стало добавление к этим традиционным темам ещё одной — значимости знания. Не менее важным для него был и вопрос веры. В результате в его произведениях строки, посвященные духовному восприятию мира, нередко соседствуют с размышлениями о науке. В его творчестве чувствуется влияние идей просвещенного абсолютизма.</p>
    <p>Это особенно заметно в оде «В ознаменование Светлого Господнего Воскресения 1764 г.». Центральная тема этого стихотворения — идея божественного устройства Вселенной и неизбежности высшего порядка. Кулибин рассматривает мир как спроектированный механизм, где всё подчинено своим строгим законам:</p>
    <div class="wrapper">
        <EmbeddedBlock>
            <EmbeddedBlockText slot="short">…Вселенную Господь создал,
                Как часовщик часы собрал.
                Пружины там и шестерни
                Отмеривают наши дни...
            </EmbeddedBlockText>
            <EmbeddedBlockText slot="full">
                I
                Вселенную Господь создал,
                Как часовщик часы собрал.
                Пружины там и шестерни
                Отмеривают наши дни.
                Гирляндами висят планеты,
                Лучи Божественного света
                Во тьму повсюду проникают,
                Как Солнца Разума сияют.
                II
                Мешает правильному ходу
                То, что употребив свободу,
                Стремится слабый человек
                Замедлить мира плавный бег.
                Но кто в том больше виноват,
                Что плод запретный им был взят?
                Тот змий, Адама искусивший,
                Иль сам Адам, тот плод вкусивший?
                Льзя ль доискаться до причин?
                То ведает лишь Бог един.
                III
                Кружит с двенадцатью зубцами
                Незримо колесо над нами,
                За край одежды зацепит
                И жизнь земную прекратит.
                Как смертный бы не вырывался,
                Как бы спастись сам не старался,
                Той участи не избежит,
                Судьба его не пощадит.
                IV
                Явившись через Богоматерь
                Послал спасение Создатель.
                Им смерть была побеждена,
                Во тьму веков возвращена.
                Грехи и немощь всю людскую
                И злобу с суетой мирскую,
                Мир и материю любя,
                Как агнец, взял он на себя.
                V
                И был распят и погребён,
                И мёртв и жив был вместе он.
                Но вот восстал Христос из гроба,
                Свет воссиял и смолкла злоба.
                « Воскрес воистину»! — ликуем
                И, памятуя, торжествуем,
                Храня в душе завет любви,
                И просим: « Бог, благослови»!
                VI
                Но хоть исправлена махина,
                Однако мира половина
                Во тьму ещё погружена
                И разной мерзости полна.
                Враги безбожные стремятся
                Туда, где нивы колосятся,
                Где, как священный ореол,
                Державный герб простёрт — орёл.
                VII
                Кометы в воздухе несутся,
                И трубы духов раздаются
                Опять в заоблачной дали.
                Сверкают блики, гром гремит.
                Как в Откровеньи Иоанна,
                Жена, порфирой одеянна,
                Одна законности оплот.
                Пусть праздник радость ей пошлёт.
                VIII
                Покрыто море кораблями,
                И ясным светом весь сияет
                В лазурной выси небосвод.
                Ничто не сдерживает ход
                Естественный самих явлений
                В краю том. Будто некий гений
                От горя землю ту хранит.
                Так пусть она века стоит.
                IX
                О ты, царица на престоле,
                Ликуй и торжествуй, доколе
                Согласна твоя воля с Ним,
                Создателем, Отцом твоим.
                И конца света наступленья,
                Закона, веры пораженья
                И истребления Руси,
                Монархиня, не допусти!
            </EmbeddedBlockText>
        </EmbeddedBlock>
    </div>
    <p>Другой пример — стихотворение, написанное в 1767 году, когда Кулибин представлял Екатерине II свои часы “яичной фигуры". Изобретение он сопроводил строками собственного сочинения:</p>
    <div class="wrapper">
        <EmbeddedBlock>
            <EmbeddedBlockText slot="short">...Простру в том руки к щедрому богу,
                Что дал науки и милость многу,
                Сердце царицы его десницы
                Храним всегда.
                За преблагие твоя доброты,
                И все драгие ко всем щедроты,
                Свыше правитель и покровитель
                Твой зиждитель всех…
            </EmbeddedBlockText>
            <EmbeddedBlockText slot="full">
                Воспой России к щедрому Богу,
                Он бо излил милость премногу
                Десницей щедрой во всей Вселенной,
                Возвеличив тя.
                Избрал он россам на трон царицу.
                И увенчал сам императрицу
                Екатерину, милость едину,
                Предрагим венцом.
                Тебя едину, о наша матерь!
                Всем монархиню послал создатель,
                Да ты царствуешь, владычествуешь
                Над нами вечно.
                Толь процветает твоя держава,
                Везде сияет под солнцем слава,
                Луч простирает и досягает
                До других держав.
                В твоей деснице скипетр блистает!
                Во всей России всех озаряет,
                Сыплет отрады в низовы грады
                Всемилостиво.
                Егда под небом орел летает,
                Любезно к детям всегда взирает,
                С высот слетевши, крылы простерши,
                Всех покрывает.
                Так ты, свет наш, матерь благая,
                Сирым и бедным милость драгая,
                К детям грядеши и покрывши,
                Как орел птенцов.
                Шествуешь славно в низовы грады,
                Даруешь равно щит и ограды
                От горделивых и возносливых
                Народу всему.
                Не токмо знатных ты наблюдаешь,
                Но и загнанных всех защищаешь,
                Все рекут гласно и поют красно:
                Послал к нам Бог,
                Едино всем нам радость и милость
                Вьюсь сердцем, чтобы не противность
                Превысочайшей персоне вашей,
                Что рек без наук.
                Простру в том руки к щедрому Богу,
                Что дал науки и милость многу,
                Сердце царицы его десницы
                Храним всегда.
                За преблагие твоя доброты.
                И все драгие ко всем щедроты,
                Свыше правитель и покровитель
                Той зиждитель всех.
            </EmbeddedBlockText>
        </EmbeddedBlock>
    </div>
    <p>Ещё одно известное произведение Кулибина — ода графу Алексею Григорьевичу Орлову, написанная в 1771 году. Орлов, выдающийся военачальник и фаворит Екатерины II, прославился победой в Чесменском сражении 1770 года над турецким флотом. Эта битва стала символом мощи русского оружия и укрепила позиции России на международной арене. В оде Кулибин пишет:</p>
    <div class="wrapper">
        <EmbeddedBlock>
            <EmbeddedBlockText slot="short">...Пусть скотовод скотом, а хлебом — землепашец,
                Учёный человек — цветением наук,
                А воин — ратным подвигом докажут
                Любовь к стране родной. Греми же, трубный звук…
            </EmbeddedBlockText>
            <EmbeddedBlockText slot="full">
                Теперь, о муза, будь с усердьем громогласна!
                Деяния призри геройские вождей.
                Будь, светлая, по песням ты согласна
                С душой ликующей и радостной моей.
                О прошлом вспомни, муза. Это было:
                Лютейший турков яд и злобы пёсий рык.
                Но нынче словно Солнце озарило,
                Прогнав всю тьму. Веселья слышен крик.
                И вот он, храбрый воин Алексий,
                Спешит, покинув дальнюю Морею,
                Вернуться, не смотря на игрища стихий,
                От Босфора к Пантикапею.
                Пред троном разума является он сам,
                К премудрости ногам сложил свои победы.
                Он снизошёл, как сходит дух во храм,
                С царицей тихую ведёт беседу.
                Держава, уж сбылись твои все ожиданья.
                Враждебной рати нанесён удар.
                Окончились ужасные терзанья,
                Сраженья бранные. О мир, желанный дар,
                Ты послан нам клинком и силой россов;
                Дабы свою отвагу показать,
                Ряды смешавших грозных чалмоносцев
                Тебя нам принесла воинственная рать.
                Герои, вождь ваш вновь благополучен,
                Во град вошёл и радостную весть,
                Как луч, мелькнувший из-за тёмной тучи,
                Сумел добыть и к нам сюда принесть.
                Пусть скотовод скотом, а хлебом — землепашец,
                Учёный человек — цветением наук,
                А воин — ратным подвигом докажут
                Любовь к стране родной. Греми же, трубный звук.
                Неси ты, Посидон, острогу трёхзубчату,
                Ты, Венус, всех любовью одаряй.
                Урок Россиею преподан супостату.
                Мощь нашу бранную, Вселенная, познай.
                Как древле цесари, так и теперь венцами
                Лавровыми увенчаны мужи.
                Играй на лире, звякни бубенцами,
                Парнаса дева, всё уменье покажи.
                Пусть будет этот день внесён в летописанье.
                Дрожит Левант, надежда у Афин.
                Народное прекрасно ликованье,
                Когда все славят день сей, как один.
                Ликуй Отечество, ликуй единодушно,
                Отрадно нам бойцов своих встречать.
                Достигнет радость пусть обителей воздушных,
                Что б нам Творец её вернул опять.
            </EmbeddedBlockText>
        </EmbeddedBlock>
    </div>
    <p>Важной особенностью стиля Кулибина является простота языка, которая может быть неочевидной современному читателю.</p>
    <p>В начале второй половины XVIII века Ломоносов разделил все слова, которые употребляются в литературе, на три категории: те, которые есть и в русском, и в церковнославянском и известны всем; церковнославянские, которые известны всем грамотным людям; и, наконец, слова, которых в церковнославянском языке нет.</p>
    <p>В высоком штиле позволялось употреблять слова только первого и второго рода, и эта литературная норма изменилась только при реформах Карамзина.
    <br>Поэзия Кулибина относится к периоду до этого культурного сдвига. Он нарушает установленные правила и использует слова третьего рода. Его поэзия лишена придворного лоска и тяжеловесности, но при этом не уходит в просторечные народные мотивы, которые их сменят.</p>
    <p>В наше время его поэтические труды остаются малоизвестными, но они дополняют образ великого мастера, чьё имя стало нарицательным.</p>
</div>

<style>
    .wrapper {
        max-width: 329px;
        margin: 0 auto;
    }

    .poem-text {
        text-align: right;
    }

    .container {
        margin: 0;
        padding: 0;

        justify-content: center;
        align-items: center;
        height: 100vh;

        padding: 20px;
        max-width: 1000px;
        width: 100%;
    }

    h1 {
        font-size: 44px;
        color: #000957;
        text-align: center;
        line-height: 1.1;
        font-weight: bold;
        margin-bottom: 35px;
    }

    p {
        color: #000000;
        line-height: 1.6;
        margin-bottom: 15px;
    }

    @media screen and (max-width: 375px) {
        .title {
            font-size: 36px;
        }
    }
</style>
