<script>
    import EmbeddedBlock from '$lib/components/EmbeddedBlock.svelte';
    import EmbeddedBlockText from '$lib/components/EmbeddedBlockText.svelte';
</script>


<div class="content-container">
    <div class="heading-container">
        <div class="heading">
            Самокатка
        </div>
    </div>

    <ul class="content-list">
        <li class="text">
            <p>
                Самокатка, или же коляска, приводимая в действие силами человека, не была новым изобретением. Подобные устройства существовали еще в эпоху Возрождения. В России до Кулибина ее создал нижегородский крестьянин Шамшуренков. Однако Кулибин, не знакомый с этими проектами, считал свое устройство оригинальным.
            </p>
        </li>
        <li class="text">
            <p>
                Одновременно изобретатель разрабатывал четырехколесную и трехколесную самокатку, однако современники рассказывают лишь о второй. Принцип ее работы был достаточно прост: при поочередном нажатии ногами на «туфли» (так Кулибин называл педали) посредством присоединенных тяг их качательное движение переводилось во вращение оси тележки. Инерция установленного махового колеса придавала ходу равномерность. Торможение же осуществлялось с помощью натянутых часовых пружин, которые разжимались в нужный момент. Такая система тормоза была инновационной по сравнению с самокатками, созданными до Кулибина. Однако его изобретение обладало существенным недостатком — остановиться на высокой скорости было невозможно в связи с риском деформации механизма зубцов. Для уменьшения трения использовалось что-то похожее на современные подшипники (такая же система использовалась в подъемнике Кулибина). Согласно расчетам изобретателя, устройство было способно достичь скорости в 30 км/ч (что, конечно, очень сомнительно: такая скорость была бы очень высокой).
            </p>
        </li>
        <li class="text">
            <p>
                К сожалению, Кулибин по тем или иным причинам уничтожил почти все чертежи этого изобретения, из-за чего многие детали ее конструкции нам неизвестны.
            </p>
        </li>
        <li class="text">
            <p>
                После Великой французской революции похожее устройство появилось во Франции, только управлял им не слуга, а сам человек. «Бегунки» (именно так они назывались) впоследствии эволюционировали в современный велосипед.
            </p>
        </li>
        <li class="fact">
            <EmbeddedBlock title="Любопытный факт">
                <EmbeddedBlockText slot="full">
                    В 1693 г. некий европейский изобретатель Ришар создал самокатку, механизм которой был на удивление схож с механизмом самокатки Кулибина (рычаги, педали, храповое колесо). Так, два изобретателя создали практически одинаковые механизмы, при этом не зная друг друга.
                </EmbeddedBlockText>
            </EmbeddedBlock>
        </li>
    </ul>
</div>


<style>
    :root {
        --primary-color: #000957;
        --nav-font-size-for-pc: 32px;
        --nav-font-size-for-phone: 29px;
    }

    .text {
        margin-top: 20px;
        margin-left: 16px;
        margin-right: 16px;
    }

    .text p {
        font-weight: 400;
        font-size: 16px;
    }

    * {
        margin: 0;
        padding: 0;
        box-sizing: border-box;
        font-family: inherit;
    }
    .heading {
        margin-top: 16px;
        font-weight: bold;
        font-size: 48px;
        color: var(--primary-color);
    }

    .fact {
        margin-left: 16px;
        margin-right: 16px;
    }

    .heading-container {
        width: 100%;
        display: flex;
        align-items: center;
        justify-content: center;
    }

    @media screen and (max-width: 300px) {
        .heading {
            font-size: 32px;
        }

        .text {
            margin-top: 15px;
        }
    }

</style>
