<script>
    import EmbeddedBlock from '$lib/components/EmbeddedBlock.svelte';
    import EmbeddedBlockText from '$lib/components/EmbeddedBlockText.svelte';
    import Slider from '$lib/components/Slider.svelte';
    
    const slides = [
  {
    title: "Леонтий Лукьянович Шамшуренков (1687–1758), Российская империя",
    text: '<p>Нижегородский крестьянин Шамшуренков создал свою «самобеглую коляску» на 40 лет раньше Кулибина.</p><p>В отличие от изобретения Кулибина, самокатка Шамшуренкова имела четыре колеса. Ее механизм работал следующим образом: два водителя, находясь в нижнем отсеке, стояли на педалях и, используя вес своего тела, с помощью рычажных храповиков приводили в движение храповые колеса на задней оси. Поворотной в коляске была передняя ось, закрепленная на шкворне. Управление осуществлялось либо с помощью двуплечего рычага, либо через горизонтальный круг (как в самокатке Кулибина). Смягчение хода обеспечивали вертикальные стойки рамы, к которым ремнями был подвешен кузов. Коляска могла достигать скорости 15 км/час в кратковременном рабочем режиме.</p><p>Самокатка Шамшуренкова не только не уступала зарубежным аналогам, но и во многом превосходила их. По всей видимости, устройство не имело существенных недостатков ни в замысле, ни в исполнении, так как изобретатель получил значительную денежную выплату. Однако особого интереса к самокатке это не вызвало: несмотря на желание Шамшуренкова продолжить разработку, Сенат отказался выделять дополнительные средства.</p><p>Как и самокатка Кулибина, самобеглая коляска Шамшуренкова не сохранилась до нашего времени.</p>'
},
  {
    title: "Ришар, Франция",
    text: '<p>В 1690 году французский врач Эли Ришар создал коляску, приводимую в движение лакеем, поочередно нажимавшим на педали. Приводной механизм состоял из двух педалей и двух рычажных храповиков, которые приводили в движение диски на ведущей оси. Поворот осуществлялся с помощью гибких тяг человеком, сидящим в кузове.</p><p>Эта самокатка была во многом схожа с устройством Кулибина (педали, рычаги, храповые колеса).</p>'
  }
];
</script>

<Slider {slides} />

<div class="content-container">
    <div class="heading-container">
        <div class="heading">
            Самокатка
        </div>
    </div>

    <ul class="content-list">
        <li class="text">
            <p>
                Самокатка, или же коляска, приводимая в действие силами человека, не была новым изобретением. Подобные устройства существовали еще в эпоху Возрождения. В России до Кулибина ее создал нижегородский крестьянин Шамшуренков. Однако Кулибин, не знакомый с этими проектами, считал свое устройство оригинальным.
            </p>
        </li>
        <li class="text">
            <p>
                Одновременно изобретатель разрабатывал четырехколесную и трехколесную самокатку, однако современники рассказывают лишь о второй. Принцип ее работы был достаточно прост: при поочередном нажатии ногами на «туфли» (так Кулибин называл педали) посредством присоединенных тяг их качательное движение переводилось во вращение оси тележки. Инерция установленного махового колеса придавала ходу равномерность. Торможение же осуществлялось с помощью натянутых часовых пружин, которые разжимались в нужный момент. Такая система тормоза была инновационной по сравнению с самокатками, созданными до Кулибина. Однако его изобретение обладало существенным недостатком — остановиться на высокой скорости было невозможно в связи с риском деформации механизма зубцов. Для уменьшения трения использовалось что-то похожее на современные подшипники (такая же система использовалась в подъемнике Кулибина). Согласно расчетам изобретателя, устройство было способно достичь скорости в 30 км/ч (что, конечно, очень сомнительно: такая скорость была бы очень высокой).
            </p>
        </li>
        <li class="text">
            <p>
                К сожалению, Кулибин по тем или иным причинам уничтожил почти все чертежи этого изобретения, из-за чего многие детали ее конструкции нам неизвестны.
            </p>
        </li>
        <li class="text">
            <p>
                После Великой французской революции похожее устройство появилось во Франции, только управлял им не слуга, а сам человек. «Бегунки» (именно так они назывались) впоследствии эволюционировали в современный велосипед.
            </p>
        </li>
        <li class="fact">
            <EmbeddedBlock title="Любопытный факт">
                <EmbeddedBlockText slot="full">
                    В 1693 г. некий европейский изобретатель Ришар создал самокатку, механизм которой был на удивление схож с механизмом самокатки Кулибина (рычаги, педали, храповое колесо). Так, два изобретателя создали практически одинаковые механизмы, при этом не зная друг друга.
                </EmbeddedBlockText>
            </EmbeddedBlock>
        </li>
    </ul>
</div>


<style>
    :root {
        --primary-color: #000957;
        --nav-font-size-for-pc: 32px;
        --nav-font-size-for-phone: 29px;
    }

    .text {
        margin-top: 20px;
        margin-left: 16px;
        margin-right: 16px;
    }

    .text p {
        font-weight: 400;
        font-size: 16px;
    }

    * {
        margin: 0;
        padding: 0;
        box-sizing: border-box;
        font-family: inherit;
    }
    .heading {
        margin-top: 16px;
        font-weight: bold;
        font-size: 48px;
        color: var(--primary-color);
    }

    .fact {
        margin-left: 16px;
        margin-right: 16px;
    }

    .heading-container {
        width: 100%;
        display: flex;
        align-items: center;
        justify-content: center;
    }

    @media screen and (max-width: 300px) {
        .heading {
            font-size: 32px;
        }

        .text {
            margin-top: 15px;
        }
    }

</style>
